<template>
  <div class="home">
    <h1>Сайт подготовки программиста</h1>
    <div class="imd">
      <img src="https://itproger.com/img/courses/x1663833928.jpg.pagespeed.ic.JC0wY2WpKF.webp" alt="" width=" 200">
      <p>Представляем курс по изучению основ программированию.
      В курсе для начинающих вы с нуля разберетесь в теме программирования и изучите все основные концепции этой сферы.
      Под конец курса у вас будет понимание куда двигаться далее и что изучать.</p>
    </div>
    <h2> <b>Видеоурок</b></h2>
    <div class="video">
      <iframe width="560" height="315" src="https://www.youtube.com/embed/aO4Mnz485uM" title="Основы программирования / Урок #1 – Введение в программирование с нуля" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
    
    </div>
    <h3><b>Когда появилось программирование?</b></h3>
    <p>Само по себе понятие программирование сводится к простой концепции. Программирование – процесс создания компьютерных программ.</p>
    <p>И можно предположить, что программирование появилось в дни создания первых компьютеров. На самом деле это не так. Программирование – это процесс написания алгоритма для решения какой-либо задачи. В таком случае можно сказать, что тот же ткацкий станок стал одним из первых проявлений программирования, ведь он позволил программировать узоры на тканях.</p>
    <p>Но назвать работников ткацких станков программистами – было бы как минимум странно. Поэтому первым проявлением программирования в нашем с вами понимании можно действительно назвать дату появления первого прототипа компьютера.</p>
    
    <h3><b>Когда появился первый компьютер?</b></h3>
    <p>Тут можно много говорить когда был создан первый прототип компьютера, но мы с вами за основу давайте возьмем дату создания первого компьютера с возможностью его запрограммировать.</p>
    <p>Таким компьютером стал <b>ENIAC</b>, что был представлен 14 февраля 1946 года в Соединенных Штатах Америки. Компьютер был гигантских размеров. Его вес составлял 30 тонн, а для его работы использовались лампы, коих в нем было около 18 000 единиц.</p>
    <p>За одну секунду он был способен выполнить около 5000 операций. Цифра не маленькая, но для сравнения современный обычный ПК, что есть у каждого из нас выполняет в среднем свыше 100 миллионов операций за одну секунду. И это не говоря уже про суперкомпьютеры, что используются крупными компаниями.</p>
    <p>До ENIAC были представлены и другие компьютеры, но именно он стал первым компьютером, в который можно было ввести какие-то данные и уже на основе этих данных он решал определенную задачу.</p>
    <p>Так что датой создания программирования в привычном для нас понимании можно считать 1946 год.</p>
  
    <hr>
  </div>
  
</template>

<script>
// @ is an alias to /src

export default {
  name: 'HomeView',
  
}
</script>

<style>

.imd{
  height: 200px;
  width: 800px;
  display: flex;
 align-items: center; 
}
.home{
  margin-left: 400px;
  height: 1200px;
  width: 1000px;
  border: 2px;
  
}
p{
  text-align: left;
}
h3{
  text-align: left;
}


</style>