<template>
    <div class="tip">
        <h1>Основы C#</h1>
        <div class="mag">
            <h3>ВВЕДЕНИЕ</h3>
            <p>C# (читается как «Си шарп») — это язык программирования от компании Microsoft. Изначально его создавали для проектов под Windows, но теперь это по-настоящему универсальный язык: на нём пишут игры, десктопные приложения, веб-сервисы, нейросети и даже графику для метавселенных.</p>
            <p>Один из ведущих разработчиков языка — легендарный Андерс Хейлсберг, который до C# успел сделать Turbo Pascal и Delphi, а после — TypeScript (майкрософтовский JS на стероидах).</p>
        </div>
        <div class="tab">
            <input checked id="tab-btn-1" name="tab-btn" type="radio" value="">
            <label for="tab-btn-1">Привет, Мир!</label>
            <input id="tab-btn-2" name="tab-btn" type="radio" value="">
            <label for="tab-btn-2">Комментарии</label>
            <input id="tab-btn-3" name="tab-btn" type="radio" value="">
            <label for="tab-btn-3">Инструкции(Statements)</label>
            <input id="tab-btn-4" name="tab-btn" type="radio" value="">
            <label for="tab-btn-4">Как мы проверяем ваши решения</label>
            <input id="tab-btn-5" name="tab-btn" type="radio" value="">
            <label for="tab-btn-5">Ощибки оформления</label>



            <div class="tab-content" id="content-1">
                <div class="halo">
                    <h3>C#: Привет, Мир!</h3>
                    <p>C# — это язык программирования, созданный компанией Microsoft. Это один из самых популярных языков программирования в России и в мире — достаточно глянуть на число открытых вакансий (а еще на предлагаемые зарплаты). C# — кроссплатформенный язык. Это означает что на нем можно писать веб-сервисы, настольные приложения, мобильные приложения, приложения для интернета вещей (IoT), игры и еще многое другое.</p>
                    <p>Microsoft для своего языка создало удобную среду для разработки (IDE) — Visual Studio. Для того чтобы начать разрабатывать не нужно устанавливать десятки SDK, настраивать текстовые редакторы и т.д. Visual Studio включает в себя все нужные инструменты. Достаточно его установить и уже можно с удобством разрабатывать все что угодно.</p>
                    <p>C# входит в семейство C-подобных языков. Туда же входят некоторые другие языки: C++, Java, JavaScript, PHP. Даже если C# не понравится как первый язык, то перейти на другой будет не сложно.</p>
                    <hr>
                    <p>Изучать язык программирования, по традиции, начинают с программы, которая пишет 'Hello, World!'.</p>
                    <div class="container"></div>
                    <div class="container1">Hello, World!</div>
                    <p>В языке C# это будет выглядеть так:</p>
                    <div class="container2">
                        <p>Console.WriteLine("Hello, World!");</p>
                    </div>
                    <p>Текст Hello, World! появится на экране благодаря команде Console.WriteLine(). Такая команда выводит на экран информацию, которая указана в скобках ("Hello, World!"), и переводит курсор на новую строку. То есть вся информация после Hello, World! будет выводиться на экране на следующей строке.</p>
                </div>
            </div>




            <div class="tab-content" id="content-2">
                <div class="halo">
                    <h3>C#: Комментарии</h3>
                    <p>Практически все языки программирования позволяют оставлять в коде комментарии. Они никак не используются кодом и нужны исключительно для людей: чтобы программист оставлял пометки для себя и для других программистов. Комментарии в C# бывают трёх видов:</p>
                    <p><b>Однострочные комментарии</b> начинаются с //. После этих двух символов может следовать любой текст, вся строчка не будет анализироваться и исполняться.</p>
                    <p>Комментарий может занимать всю строчку:</p>
                    <div class="container2">
                        <p>// For Winterfell!</p>
                    </div>
                    <p>или может находиться на строчке после какого-нибудь кода:</p>
                    <div class="container2">
                        <p>Console.WriteLine("I am the King"); // => For Lannisters!</p>
                    </div>
                    <p><b>Многострочные комментарии</b> начинаются с /* и заканчиваются на */. Принято каждую строчку начинать с символа *, хотя технически это и не обязательно.</p>            
                    
                    <div class="container2">
                        <p>/*</p>
                        <p>* The night is dark and</p>
                        <p>* full of terrors.</p>
                        <p>*/</p>
                        <p>Console.WriteLine("I am the King"); // => I am the King</p>
                    </div>
                    <p>Документирующие комментарии для каждой строчки используют ///.</p>
                    <p>Документирующие комментарии, являясь, по сути, подвидом однострочных, несут дополнительную функцию – добавляют подсказки к коду для внешних пользователей нашего кода. Мы поговорим о них позже – когда разберём классы и методы.</p>
                </div>
            </div>




            <div class="tab-content" id="content-3">
                <div class="halo">
                    <h3>C#: Инструкции (Statements)</h3>
                    <p>Инструкция — это команда для компьютера. Код на C# — это набор инструкций, которые, обычно, отделяются друг от друга символом ;. Вот пример кода с двумя инструкциями:</p>
                    <div class="container2">
                        <p>Console.WriteLine("Mother of Dragons");</p>
                        <p>Console.WriteLine("Dracarys!");</p>
                    </div>
                
                    <p>При запуске этого кода на экран последовательно выводятся два предложения:</p>
                
                    <div class="container"></div>
                    <div class="container1">
                        <p>Mother of Dragons</p>
                        <p>Dracarys!</p>
                    </div>
                    <p>Почему это важно знать? Инструкция — это единица исполнения. Программа которая запускает код на C#, выполняет инструкции строго по очереди. И мы, как разработчики, должны понимать этот порядок и уметь мысленно разделять программу на независимые части, удобные для анализа.</p>
                    <p>Теоретически инструкции можно написать последовательно друг за другом без переноса на новую строчку:</p>

                    <div class="container2">
                        <p>Console.WriteLine("Mother of Dragons."); Console.WriteLine("Dracarys!");</p>
                    </div>
                    <p>Результат на экране будет таким же, но на практике такой подход считается плохим.</p>
                </div>
            </div>




            <div class="tab-content" id="content-4">
                <div class="halo">
                    <h3>C#: Как мы проверяем ваши решения</h3>
                    <p>Наш сайт автоматически проверяет ваши решения. Как это работает?</p>
                    <p>В самом простом случае система просто запускает ваш код и смотрит на то, что вывелось на экран. А потом сверяет с тем, что мы «ожидали» по заданию.</p>
                    <p>В следующих, более сложных уроках вы будете писать методы — некие мини-программы, принимающие информацию из внешнего мира и производящие какие-то операции. Проверка ваших решений в таких случаях выглядит немного сложнее: система запускает ваше решение и передаёт какую-то информацию. Система также знает — «ожидает» — какой именно ответ должен вернуть правильный метод при таких входных данных.</p>
                    <p>Например, если ваша задача — написать код для сложения двух чисел, то проверочная система будет передавать ему разные комбинации чисел и сверять ответ вашего кода с реальными суммами. Если во всех случаях ответы совпадут, то решение считается верным.</p>
                    <p>Вот простой пример: помните задание из 1го упражнения, где вам надо было вывести на экран "Hello, World!"?. Допустим, вы допустили небольшую опечатку. Система ответит примерно так:</p>
                    <div class="container"></div>
                    <div class="container1">
                        <p>Submission#0.output == "Hello, World!"</p>
                        <p>             .    . __</p>
                        <p>             \_ __/ |</p>
                        <p>               |    False, strings differ at index 5, ' ' != ','</p>
                        <p>               "Hello World!"</p>
                    </div>
                    <p>Читать это следует так: в ответе ожидалось строка с "Hello, World!" (первая строчка после двойного '='), но в вместо него пришла строка "Hello World!" (нижняя строчка)". Строки отличаются символом под номером 5. В данном примере пропущена запятая.</p>
                    <p>Кроме наших тестов, будет крайне полезно экспериментировать с кодом в вашем собственном консольном приложении. Установите Visual Studio и попробуйте создать простое консольное приложение. Оцените мощь IDE, которая может сама автодополнять выражения и подчеркивать места с ошибками.</p>
                    <hr>
                    <p>Иногда в процессе решения будет казаться, что вы сделали все правильно, но система "капризничает" и не принимает решение. Подобное поведение практически исключено. Нерабочие тесты просто не могут попасть на сайт, они автоматически запускаются после каждого изменения. В подавляющем большинстве таких случаев, (а все наши проекты в сумме провели миллионы проверок за много лет), ошибка содержится в коде решения. Она может быть очень незаметной, вместо английской буквы случайно ввели русскую, вместо верхнего регистра использовали нижний или забыли вывести запятую. Другие случаи сложнее. Возможно ваше решение работает для одного набора входных данных, но не работает для другого. Поэтому всегда внимательно читайте условие задачи и вывод тестов. Там почти наверняка есть указание на ошибку.</p>
                    <p>Однако, если вы уверены в ошибке или нашли какую-то неточность, то вы всегда можете указать на нее. В конце каждой теории есть ссылка на содержимое урока на гитхабе (этот проект полностью открытый!). Перейдя туда, вы можете написать issue, посмотреть содержимое тестов (там видно, как вызывается ваш код) и даже отправить pullrequest. Если для вас это пока темный лес, то подключитесь в наше сообщество Telegram Hexlet, там в канале Волонтеры мы всегда поможем.</p>
                </div>
            </div>
            
            
            
            
            <div class="tab-content" id="content-5">
                <div class="halo">
                    
                        <h3>C#: Ошибки оформления (синтаксиса)</h3>
                        <p>В человеческих языках грамматика важна, но текст с ошибками чаще всего можно понять и прочитать. В программировании всё строго. Любое мельчайшее нарушение, и программа не запустится. Примером может быть забытая ;, неправильно расставленные скобки и другие детали. Подобные ошибки называются синтаксическими, потому что они нарушают правила синтаксиса языка. Если программа на C# написана синтаксически некорректно, то компилятор выводит на экран соответствующее сообщение, а также указание на файл и строчку в нём, где по его мнению произошла ошибка. Ниже пример кода с синтаксической ошибкой:</p>
                        <div class="container2">
                        <p>Console.WriteLine("alala</p>
                        </div>
                        <p>Если попробовать запустить код выше, то мы увидим следующее сообщение:</p>
                        <div class="container"></div>
                        <div class="container1">
                            <p>|: error CS1010: Newline in constant</p>
                            <p>|: error CS1026: ) expected</p>
                        </div>
                        <p>С одной стороны, ошибки синтаксиса — самые простые, потому что они связаны исключительно с грамматическими правилами написания кода, а не с самим смыслом кода. Их легко исправить: нужно лишь найти нарушение в записи. С другой стороны, компилятор не всегда может чётко указать на это нарушение. Поэтому бывает, что забытую скобку нужно поставить не туда, куда указывает сообщение об ошибке.</p>
                </div>
            </div>
        </div>
    </div>
</template>
<script>

</script>
<style>
.tip{
    margin-left: 400px;
    height: 1500px;
    width: 1000px;
    border: 2px;
}
.tab {
    
    display: flex;
    flex-wrap: wrap;
}

.tab > input[type="radio"] {
    display: none;
}

.tab-content {
    
    display: none;
    width: 100%;
    margin-top: 1rem;
}

#tab-btn-1:checked~#content-1,
#tab-btn-2:checked~#content-2,
#tab-btn-3:checked~#content-3,
#tab-btn-4:checked~#content-4,
#tab-btn-5:checked~#content-5 {
    display: block;
}

.tab > label {
    display: block;
    padding: 0.5rem 1rem;
    cursor: pointer;
    transition: color .15s ease-in-out,background-color .15s ease-in-out,border-color .15s ease-in-out;
    text-decoration: none;
    color: #0d6efd;
    border: 0;
    border-radius: 0.375rem;
    background: 0 0;
}

.tab > input[type="radio"]:checked + label {
    cursor: default;
    color: #fff;
    background-color: #0d6efd;
}
.mag{
    margin: 50px;
    text-align: left
}
.halo{
    margin: 50px
}
.hal{
    text-align: left;
}

.container {
  width: 80%;
  margin: 0 auto;
  padding: 15px;
  background-color: #474747;
  border-top-left-radius: 10px;
  border-top-right-radius: 10px;

}
.container1 {
  width: 80%;
  margin: 0 auto;
  padding: 10px;
  background-color: #c9c9c9;
  text-align: left;
}
.container2{
    width: 80%;
    margin: 0 auto;
    padding: 10px;
    background-color: #eeeeee;
    text-align: left;
    border-top-left-radius: 10px;
    border-top-right-radius: 10px;
}
</style>