<template>
   <div class="pok">
    <h1>Основы CSS</h1>
        <div class="mag">
            <h3>ВВЕДЕНИЕ</h3>
            <p>CSS (Cascading Style Sheets, каскадные таблицы стилей) — язык описания внешнего вида HTML-документа. Это одна из базовых технологий в современном интернете. Практически ни один сайт не обходится без CSS, поэтому HTML и CSS действуют в единой связке.</p>
            <p>Каскадные таблицы стилей работают с HTML, но это совершенно другой язык. HTML структурирует документ и упорядочивает информацию, а CSS взаимодействует с браузером, чтобы придать документу оформление.</p>
            <p>На языке HTML мы создаем размеченный текст — документ с гиперссылками, таблицами, маркированными списками, разными начертаниями шрифтов, заголовками, подзаголовками и так далее. Получаем «простыню» текста с таблицами и иллюстрациями. Интернет изобрели ученые, и для них такое положение вещей было приемлемым. Но все изменилось, когда WWW пошел в массы и свои странички начали создавать простые пользователи, которые хотели индивидуальности и самовыражения, а также коммерческие компании со своими корпоративными стандартами оформления. В общем, веб-страницам понадобилось индивидуальное оформление: стиль.</p>
            <p>Поэтому берем HTML-основу — и подключаем к ней стиль CSS. С помощью CSS красиво оформляем существующий текст, то есть прописываем уникальные свойства элементам HTML.</p>
        </div>
        <div class="tab">
            <input checked id="tab-btn-111" name="tab-btn" type="radio" value="">
            <label for="tab-btn-111">Каскадные таблицы стилей</label>
            <input id="tab-btn-222" name="tab-btn" type="radio" value="">
            <label for="tab-btn-222">Использование CSS в HTML</label>
            <input id="tab-btn-333" name="tab-btn" type="radio" value="">
            <label for="tab-btn-333">Наследование стилей</label>
            <input id="tab-btn-444" name="tab-btn" type="radio" value="">
            <label for="tab-btn-444">Запись стилей в теге style</label>
            <input id="tab-btn-555" name="tab-btn" type="radio" value="">
            <label for="tab-btn-555">Базовые стили тегов</label>
            <input id="tab-btn-666" name="tab-btn" type="radio" value="">
            <label for="tab-btn-666">Классы</label>
            <input id="tab-btn-777" name="tab-btn" type="radio" value="">
            <label for="tab-btn-777">Селекторы</label>
            <input id="tab-btn-888" name="tab-btn" type="radio" value="">
            <label for="tab-btn-888">Каскадность</label>
            <input id="tab-btn-999" name="tab-btn" type="radio" value="">
            <label for="tab-btn-999">Приоритет стилей</label>



            <div class="tab-content" id="content-1">
                <div class="halo">
                    <h3>CSS: Каскадные таблицы стилей</h3>
                    <p>В курсе, посвящённом языку разметки HTML, были рассмотрены различные элементы, которые, по умолчанию, имели стилевое оформление: параграфы отделялись отступами, ссылки отличались цветом, заголовки различались размером текста и т.д. Будучи разработчиком можно изменять это оформление и добавлять совершенно новое. Добавить фон к тексту? Изменить размеры элементов? Создать анимацию? Всё это можно сделать с помощью CSS (англ. Cascading Style Sheets — Каскадные таблицы стилей) — языка, который определяет, как будут выглядеть HTML-элементы в браузере.</p>
                    <p>Курс по CSS является логическим продолжением курса по HTML. Многие теги и понятия, которые будут встречены по ходу прохождения уже рассматривались.</p>
                    <p>На примере ниже показывается вывод текста без использования своего CSS (то есть применяются те стили, которые «проставляет» браузер) и то, как можно стилизовать документ с использованием CSS.</p>
                    <h3>Пример текста со стандартным оформлением</h3>
                    <div class="container2">
                        <h3>Параграфы</h3>
                        <p>Параграфы создаются с помощью парного тега &lt;p&gt;, в тело которого помещается небольшая часть текста. Например:</p>
                        <div class="container2">
                            <p>&lt;p&gt;Первый параграф&lt;/p&gt;</p>
                            <p>&lt;p&gt;Второй параграф&lt;/p&gt;</p>
                        </div>
                    </div>
                    <p>Теперь текст читается проще, и можно быстро отделить примеры кода от описания. В курсе будут рассмотрены базовые CSS-правила для работы с текстом и блоками, которые позволят оформить текст и визуально структурировать информацию.</p>
                </div>
            </div>




            <div class="tab-content" id="content-2">
                <div class="halo">
                    <h3>CSS: Использование CSS в HTML</h3>
                    <p>Язык стилей CSS не связан с HTML напрямую. Необходимо указать браузеру, откуда нужно загрузить и интерпретировать стили. Для этого есть три способа:</p>
                    <ul>
                        <ol class="hal">Указать стили в качестве значения атрибута style. Такую запись называют «инлайн» (inline), что означает запись правила в одну строку с использованием атрибута style.</ol>
                        <ol class="hal">Использовать специальный тег &lt;style&gt;, который указывают в секции head. Браузер обработает всё, что написано внутри этого тега как CSS код</ol>
                        <ol class="hal">Подключать отдельный файл со стилями. В этом случае создаётся файл с расширением .css, в котором записываются CSS правила. Для подключения файла используется мета-тег &lt;style&gt;</ol>
                    </ul>
                    <p>В этом уроке рассмотрим принцип инлайн записи стилей с помощью атрибута style. Какой бы способ подключения стилей вы не выбрали, синтаксис правил остаётся неизменным: название-свойства: значение;. Важно не забывать добавлять символ ; после значения свойства. Так браузер сможет отделить правила друг от друга.</p>
                    <p>Один из основных способов «попробовать» стили — работа с текстом. CSS позволяет оформлять текст множеством способов: увеличивать размер шрифта, определять начертание, насыщенность и так далее. Все основные правила для работы с текстом рассматриваются в течениe всего курса.</p>
                    <p>Научимся менять размер шрифта. Размер можно изменить с помощью свойства font-size, значением которого является число и единица измерения. Попробуем сделать текст размером 32 пикселя. Единица измерения пиксель обозначается с помощью сокращения px. Подробнее про различные единицы измерения и то, как они работают, будет рассказано в следующих уроках</p>
                    <div class="container2">
                        <p>&lt;p style="font-size: 32px;"&gt;Большой текст&lt;p&gt;</p>
                    </div>
                    <p></p>
                    <div class="container2">
                        <h2>Большой текст</h2>
                    </div>
                </div>
            </div>




            <div class="tab-content" id="content-3">
                <div class="halo">
                    <h3>CSS: Наследование стилей</h3>
                    <p>При использовании стилей в CSS часто затрагивается не только тот элемент, для которого указаны стили, но и вложенные в него теги. Такие стили называются наследуемые. Стиль font-size из прошлого урока является наследуемым — он применится ко всем вложенным тегам.</p>
                    <div class="container2">
                        <p>&lt;div style="font-size: 20px;"></p>
                        <p>Размер шрифта, которым написан этот текст — 20 пикселей.</p>
                        <p>&lt;p&gt;Вложенный параграф также будет иметь размер шрифта 20 пикселей.&lt;/p&gt;</p>
                        <p>&lt;/div></p>
                    </div>
                    <p></p>
                    <div class="container2">
                        <h3>Размер шрифта, которым написан этот текст — 20 пикселей.</h3>
                        <h3>Вложенный параграф также будет иметь размер шрифта 20 пикселей.</h3>
                    </div>
                    <p>Помимо стилей, которые наследуются для всех вложенных тегов, в CSS есть множество стилей, которые уникальны для того элемента, к которому их применили.</p>
                    <p>Одним из таких свойств является border, позволяющий установить рамку вокруг элемента. Но эта же рамка не будет копироваться для каждого внутреннего элемента.</p>
                    <div class="container2">
                        <p>&lt;div style="border: 2px solid #000;"&gt;</p>
                        <p>У блока появится рамка шириной 2 пикселя</p>
                        <p>&lt;p&gt;А у параграфа своей рамки не будет. При необходимости она устанавливается отдельно&lt;/p&gt;</p>
                        <p>&lt;p style="border: 1px solid #000;"&gt;Например, вот так&lt;/p&gt;</p>
                        <p>&lt;div></p>
                    </div>
                    <p></p>
                    <div class="rop">
                        <p>У блока появится рамка шириной 2 пикселя</p>
                        <p>А у параграфа своей рамки не будет. При необходимости она устанавливается отдельно</p>
                        <div class="rol">
                            <p>Например, вот так</p>
                        </div>
                    </div>
                </div>
            </div>




            <div class="tab-content" id="content-4">
                <div class="halo">
                    <h3>CSS: Запись стилей в теге style</h3>
                    <p>Основная проблема использования атрибутов для определения стилей — их перегруженность. Часто разметка HTML содержит очень много элементов, а с добавлением стилей кода становится намного больше, что плохо сказывается на чтении разметки.</p>
                    <p>Вторая проблема — исправление стилей. Для этого необходимо сначала найти нужный элемент в коде, а потом отредактировать его стили. Таких элементов на странице может быть 10, 20, 100. А для одноимённых тегов придётся записывать стили отдельно для каждого элемента.</p>
                    <p>Возникает естественное желание иметь все стили в одном месте, где можно было бы их быстро редактировать. Таким решением является использование тега &lt;style&gt;, внутри которого могут располагаться все необходимые стили.</p>
                    <p>Возьмём пример из прошлого урока:</p>
                    <div class="container2">
                        <p>&lt;div style="font-size: 20px;"&gt;</p>
                        <p>Этот текст будет с размером шрифта 20 пикселей</p>
                        <p>&lt;li&gt;Вложенный параграф также будет иметь размер шрифта 20 пикселей&lt;/li&gt;</p>
                        <p>&lt;/div&gt;</p>
                    </div>
                    <p>Чтобы избавиться от атрибутов, добавим тег style и укажем, что для тега &lt;div&gt; используется шрифт размером в 20 пикселей.</p>
                    <div class="container2">
                        <p>&lt;style&gt;</p>
                        <p>div {</p>
                        <p>font-size: 20px;</p>
                        <p> }</p>
                        <p>&lt;/style&gt;</p>
                        <p>&lt;div&gt;</p>
                        <p>Этот текст будет с размером шрифта 20 пикселей</p>
                        <p>&lt;p&gt;>Вложенный параграф также будет иметь размер шрифта 20 пикселей&lt;/p&gt;</p>
                        <p>&lt;/div&gt;</p>
                    </div>
                    <p>Таким же образом можно указать, что у параграфа будет размер шрифта 10 пикселей.</p>
                    <div class="container2">
                        <p>&lt;style&gt;</p>
                        <p>div {</p>
                        <p>font-size: 20px;</p>
                        <p> }</p>
                        <p>p {</p>
                        <p>font-size: 10px;</p>
                        <p> }</p>
                        <p>&lt;/style&gt;</p>
                        <p>&lt;div&gt;</p>
                        <p>Этот текст будет с размером шрифта 20 пикселей</p>
                        <p>&lt;p&gt;>Вложенный параграф также будет иметь размер шрифта 10 пикселей&lt;/p&gt;</p>
                        <p>&lt;/div&gt;</p>
                    </div>
                    <hr>
                    <p>Внутри тега &lt;style&gt; использовалась конструкция вида:</p>
                    <div class="container2">
                        <p>имя_тега {</p>
                        <p>свойство: значение;</p>
                        <p>}</p>
                    </div>
                    <p>Всё, что было записано до открывающей скобки { называется селектор. Селекторы — правила, по которым браузер определяет к какому элементу нужно добавить стили. С некоторыми из селекторов мы познакомимся чуть позже. В примерах выше используются селекторы по тегу, то есть стили будут применяться ко всем элементам с тегом, указанном в качестве селектора</p>
                    <div class="container2">
                        <p>/* Для всех элементов div будет установлен размер шрифта 20px */</p>
                        <p>div {</p>
                        <p> font-size: 20px;</p>
                        <p>}</p>
                    </div>
                </div>
            </div>
            
            
            
            
            <div class="tab-content" id="content-5">
                <div class="halo">
                    
                        <h3>CSS: Базовые стили тегов</h3>
                        <p>По умолчанию, все HTML-теги имеют своё стандартное оформление. Это оформление задают браузеры, причём каждый браузер может задать свой стиль. Из-за этого одна и та же вёрстка может выводиться по разному, в зависимости от браузера, операционной системы и системных настроек.</p>
                        <p>Например, заголовок первого уровня &lt;h1&gt; в браузерах имеет размер 2em, что обозначает в два раза больше размера шрифта в блоке. Это значение не фиксировано — оно может меняться из-за настроек системы, или если разработчики браузера решили сделать его немного другим.</p>
                        <p>Используя тег &lt;style&gt; мы научились менять стили для всех элементов сразу, например:</p>
                        <div class="container2">
                            <p>h1 {</p>
                            <p>  font-size: 35px;</p>
                            <p>}</p>
                        </div>
                        <p>Но такой вариант удобен лишь для установки первоначальных/основных значений для нашей веб-страницы. В её разных частях могут понадобиться разные стили оформления заголовков одного уровня. Мы научимся решать эту задачу с помощью селекторов CSS и атрибутов HTML в следующих уроках. Главное помнить, что почти все элементы имееют стили по умолчанию, что может быть как пользой, так и неудобством при разработке страницы</p>
                </div>
            </div>





            <div class="tab-content" id="content-6">
                <div class="halo">
                    <h3>CSS: Классы</h3>
                    <p>Основное решение для стилизации конкретного участка страницы — использование классов. Они помогают задать нужный нам стиль не разом для всех элементов на странице, а только для тех элементов, у которых указан необходимый класс.</p>
                    <p>Чтобы задать стиль для класса в CSS используется селектор .название-класса. Обратите внимание на точку — именно так браузер понимает, что данный стиль указывается для класса.</p>
                    <div class="container2">
                        <p>&lt;p class="paragraph"&gt;</p>
                        <p>Текст нашего параграфа.</p>
                        <p> Именно с помощью класса paragraph в CSS</p>
                        <p>будут устанавливаться свойства для этого блока текста</p>
                        <p>&lt;/p&gt;</p>
                    </div>
                    <p></p>
                    <div class="container2">
                        <p>.paragraph {</p>
                        <p> color: #333333;</p>
                        <p>/*</p>
                        <p>Правило color устанавливает цвет текста.</p>
                        <p>В данном случае — это серый цвет со значением #333333</p>
                        <p>*/</p>
                        <p>}</p>
                    </div>
                    <p>Так как классов с одинаковым именем на странице может быть много, то это правило сработает для всех элементов, у которых атрибут класс равен paragraph.</p>
                </div>
            </div>





            <div class="tab-content" id="content-7">
                <div class="halo">
                    <h3>CSS: Селекторы</h3>
                    <p>В уроках уже встречались селекторы по тегу и классу. Селектор — это описание того, к чему нужно применить тот или иной стиль CSS. Они бывают достаточно сложными, указывая не просто конкретный элемент, но и место, где он находится или внутри какого тега. Вспомним про селектор по классу. Он применяется к любому элементу, класс которого мы указали.</p>
                    <div class="container2">
                        <p>&lt;p class="text-bold"&gt;Жирный текст внутри параграфа&lt;/p&gt;</p>
                        <p>&lt;div class="text-bold"&gt;Ещё один текст внутри простого блочного элемента. Так как у него тоже есть класс text-bold, то он будет с жирным начертанием&lt;/div&gt;</p>
                    </div>
                    <p></p>
                    <div class="container2">
                        <p>.text-bold {</p>
                        <p>  font-weight: bold;</p>
                        <p>}</p>
                    </div>
                    <p>Свойство font-weight со значением bold установит жирное начертание текста. С этим свойством вы подробнее познакомитесь при изучении оформления текста. Сейчас самое главное — этот стиль будет применён и к параграфу, и к блочному элементу &lt;div&gt;, так как они имеют один и тот же класс.</p>
                    <p>Ещё один уже знакомый селектор — селектор по тегу. Его назначение — установка стилей для всех тегов на странице. Это очень полезно, если нужно установить первоначальные стили для тегов в рамках всего проекта. Например, установить шрифт, его размер и насыщенность.</p>
                    <div class="container2">
                        <p>p {</p>
                        <p>  color: #333;</p>
                        <p>  font: 18px/1.5 sans-serif;</p>
                        <p>}</p>
                    </div>
                    <p>Используйте селектор по тегу только для установки глобальных правил в рамках всего проекта. Это важно, так как стили будут применяться для всех тегов разом и можно, случайно, перезаписать уже существующие стили</p>
                    <p>Ещё одним способом указать стили является использование селектора по идентификатору. Используя атрибут id, можно указать уникальное имя для любого элемента на странице. Если данное имя указано, то к элементу возможно обратиться используя селектор по идентификатору. Для этого используется селектор вида #имя_идентификатора</p>
                    <div class="container2">
                        <p>&lt;p id="red"&gt;Красный параграф&lt;/p&gt;</p>
                    </div>
                    <p></p>
                    <div class="container2">
                        <p>#red {</p>
                        <p>  color: red;</p>
                        <p>}</p>
                    </div>
                    <p>Важно помнить, что значение идентификатора уникально. На странице может быть только один элемент с одним конкретным значением. Например, в примере выше уже использован идентификатор red на параграфе. Второго такого элемента на странице не может быть. По этой причине идентификаторы указывают для больших обёрток, например для основной шапки сайта, но это не обязательное условие</p>
                </div>
            </div>





            <div class="tab-content" id="content-8">
                <div class="halo">
                    <h3>CSS: Каскадность</h3>
                    <p>Мы уже знаем, что CSS переводится как «Каскадные таблицы стилей». С таблицей стилей к этому моменту всё ясно, но что значит каскадные? Дело в том, что указать стили для элемента можно не только в одном месте.</p>
                    <p>Представьте каскад водопадов. Они перетекают друг в друга, накапливая всё больше и больше воды. В конечном итоге весь каскад окажется в общем бассейне. В CSS слово каскадность обозначает такое же действие, только вместо водопадов перетекают CSS свойства. Другими словами каскадность — возможность языка CSS накладывать свойства друг на друга, а также расширять свойства в селекторах.</p>   
                    <p>Создадим блок с классами text-bold и text-dark и укажем несколько свойств в разных селекторах:</p>
                    <div class="container2">
                        <p>&lt;p class="text-bold text-dark"&gt;Важный текст о вреде сложного CSS&lt;/p&gt;</p>
                    </div>
                    <p></p>
                    <div class="container2">
                        <p>p {</p>
                        <p>  font-size: 20px;</p>
                        <p>}</p>
                        <p>.text-bold {</p>
                        <p>  font-weight: bold;</p>
                        <p>}</p>
                        <p>.text-dark {</p>
                        <p>  color: #333;</p>
                        <p>}</p>
                    </div>
                    <p>Если вставить этот пример в редактор, то выведется жирный текст размером 20 пикселей тёмного цвета. Произошло это благодаря каскадности — браузер объединил все стили из разных селекторов и получил следующие инструкции для стилизации элемента:</p>
                    <div class="container2">
                        <p>p {</p>
                        <p>  font-size: 20px;</p>
                        <p>  font-weight: bold;</p>
                        <p>  color: #333;</p>
                        <p>}</p>
                    </div>
                    <p>Это и есть каскадность стилей в CSS. Хоть мы и использовали разные селекторы, но, в конечном итоге, браузер объединил их в единый набор правил для элемента</p>
                </div>
            </div>




            <div class="tab-content" id="content-9">
                <div class="halo">
                    <h3>CSS: Приоритет стилей</h3>
                    <p>Говоря о каскадности, возникает вопрос: «А что произойдёт, если в разных источниках будут одинаковые правила для элемента, но с разными значениями?». В таком случае есть правила, определяющие приоритеты стилей из разных источников. По степени важности список выглядит следующим образом:</p>
                    <ul>
                        <li class="hal">Стили в атрибуте тега</li>
                        <li class="hal">Стили в отдельном файле</li>
                        <li class="hal">Стили по умолчанию, которые добавляет браузер</li>
                    </ul>
                    <p>Значения, указанные в атрибуте style будут важнее свойств в теге &lt;/style&gt;, а они будут важнее стандартных стилей браузера.</p>
                    <h3>Приоритеты селекторов</h3>
                    <p>Важной чертой CSS является то, что разные типы селекторов имеют разный приоритет. Если стили противоречат друг другу в разных селекторах, то вступает в дело принцип приоритета.</p>
                    <p>Разберём на примере. Создадим параграф с классом red и идентификатором blue</p>
                    <div class="container2">
                        <p>&lt;p id="blue" class="red"&gt;Текст с классом red и идентификатором blue&lt;/p&gt;</p>
                    </div>
                    <p>Добавим противоречащие друг другу стили для класса, идентификатора и тега:</p>
                    <div class="container2">
                        <p>p {</p>
                        <p>  color: black;</p>
                        <p>}</p>
                        <p>.red {</p>
                        <p>  color: red;</p>
                        <p>}</p>
                        <p>#blue {</p>
                        <p>  color: blue;</p>
                        <p>}</p>
                    </div>
                    <p>Какого цвета будет параграф? Попробуйте выполнить этот пример в редакторе. Вы увидите, что текст будет синего цвета. С чем это связано?</p>
                    <p>У селекторов также существуют приоритеты. Условно можно расставить селекторы в следующем порядке по приоритету:</p>
                    <ul>
                        <ol class="hal">Селектор по идентификатору (#blue)</ol>
                        <ol class="hal">Селектор по классу (.red)</ol>
                        <ol class="hal">Селектор по тегу (p)</ol>
                    </ul>
                    <p>Где 1 — самый высокий приоритет, а 3 — самый низкий.</p>
                    <p>По этим правилам можно понять, что свойства указанные в селекторе по идентификатору будет обладать большим приоритетом, чем стили у селектора по тегу и классу. Поэтому параграф в прошлом примере был синим.</p>
                </div>
            </div>
        </div>
   </div>
</template>

<script>

</script>

<style>
.rop{
    border: 2px solid black;
    border-top-left-radius: 10px;
    border-top-right-radius: 10px;
    border-bottom-left-radius: 10px;
    border-bottom-right-radius: 10px;
}
.rol{
    border: 1px solid black;
    
}
.pok{
    margin-left: 400px;
    height: 2000px;
    width: 1000px;
    border: 2px;
}
.tab {
    
    display: flex;
    flex-wrap: wrap;
}

.tab > input[type="radio"] {
    display: none;
}
.tab-content {
    
    display: none;
    width: 100%;
    margin-top: 1rem;
}
#tab-btn-111:checked~#content-1,
#tab-btn-222:checked~#content-2,
#tab-btn-333:checked~#content-3,
#tab-btn-444:checked~#content-4,
#tab-btn-555:checked~#content-5,
#tab-btn-666:checked~#content-6,
#tab-btn-777:checked~#content-7,
#tab-btn-888:checked~#content-8,
#tab-btn-999:checked~#content-9 {
    display: block;
}
.tab > label {
    display: block;
    padding: 0.5rem 1rem;
    cursor: pointer;
    transition: color .15s ease-in-out,background-color .15s ease-in-out,border-color .15s ease-in-out;
    text-decoration: none;
    color: #0d6efd;
    border: 0;
    border-radius: 0.375rem;
    background: 0 0;
}

.tab > input[type="radio"]:checked + label {
    cursor: default;
    color: #fff;
    background-color: #0d6efd;
}
.halo{
    margin: 50px
}
.hal{
    text-align: left;
}
.mag{
    margin: 50px;
    text-align: left
}
.container {
  width: 80%;
  margin: 0 auto;
  padding: 15px;
  background-color: #474747;
  border-top-left-radius: 10px;
  border-top-right-radius: 10px;

}
.container1 {
  width: 80%;
  margin: 0 auto;
  padding: 10px;
  background-color: #c9c9c9;
  text-align: left;
}
.container2{
    width: 80%;
    margin: 0 auto;
    padding: 10px;
    background-color: #eeeeee;
    text-align: left;
    border-top-left-radius: 10px;
    border-top-right-radius: 10px;
}
</style>