<template>
    <div class="lag"> 
        <h1>Основы HTML</h1>
        <div class="mag">
            <h3>ВВЕДЕНИЕ</h3>
            <p>HTML (Hypertext Markup Language) - это код, который используется для структурирования и отображения веб-страницы и её контента. Например, контент может быть структурирован внутри множества параграфов, маркированных списков или с использованием изображений и таблиц данных. Как видно из названия, эта статья даст вам базовое понимание HTML и его функций.</p>
            <p>HTML не является языком программирования; это язык разметки, и используется, чтобы сообщать вашему браузеру, как отображать веб-страницы, которые вы посещаете. Он может быть сложным или простым, в зависимости от того, как хочет веб-дизайнер. HTML состоит из ряда элементов, которые вы используете, чтобы вкладывать или оборачивать различные части контента, чтобы заставить контент отображаться или действовать определённым образом. Ограждающие теги могут сделать слово или изображение ссылкой на что-то ещё, могут сделать слова курсивом, сделать шрифт больше или меньше и так далее.</p>
        </div>
        <div class="tab">
            <input checked id="tab-btn-111" name="tab-btn" type="radio" value="">
            <label for="tab-btn-111">HTML разметка</label>
            <input id="tab-btn-222" name="tab-btn" type="radio" value="">
            <label for="tab-btn-222">Теги</label>
            <input id="tab-btn-333" name="tab-btn" type="radio" value="">
            <label for="tab-btn-333">Текст в HTML</label>
            <input id="tab-btn-444" name="tab-btn" type="radio" value="">
            <label for="tab-btn-444">Вложенность тегов</label>
            <input id="tab-btn-555" name="tab-btn" type="radio" value="">
            <label for="tab-btn-555">Атрибуты HTML</label>



            <div class="tab-content" id="content-1">
                <div class="halo">
                    <h3>HTML: HTML разметка</h3>
                    <p>Каждый день мы смотрим на десятки интернет-страниц, читаем на них тексты, которые выводятся, как будто из журналов. Эти страницы представляют из себя гипертекст — систему интернет-страниц, по которым можно путешествовать с помощью ссылок. Для реализации этой системы существует язык HTML.</p>
                    <p>HTML (HyperText Markup Language) — язык для разметки гипертекста. По своим функциям, HTML — набор правил, по которым браузер отличает заголовки от списков, таблицы от картинок и так далее. Язык появился в 1993 году и был призван стандартизировать правила для вывода текста внутри веб-страниц.</p>
                    <p>Даже эта страница является текстом, который описан с помощью HTML и обработан браузером. Технологии шагнули далеко вперёд, но концепция использования HTML для разметки текста остаётся неизменной и спустя много лет.</p>
                    <p>Вот пример HTML разметки:</p>
                    <div class="container2">
                        <p>&lt;section&gt;</p>
                        <p>   &lt;h2&gt;2Code Basics&lt;/h2&gt;</p>
                        <p>&lt;p&gt;</p>
                        <p>Code Basics — бесплатные практические уроки по программированию для тех,</p>
                        <p>кто начинает с нуля.</p>
                        <p>&lt;/p&gt;</p>
                        <p>&lt;p&gt;</p>
                        <p>Если вы совсем новичок и хотите научиться основам — переменным,</p>
                        <p>строкам, циклам, функциям и т.д., то Code Basics вам подойдёт.</p>
                        <p>&lt;/p&gt;</p>
                        <p>>&lt;/section&gt;</p>
                    </div>
                    <p>Не пугайтесь такого обилия непонятных слов и знаков — к концу курса вы будете понимать работу приведённой выше разметки, а также научитесь использовать разметку на своих страницах. Обратите внимание, что вся суть в разметке выше — это текст. Остальное — вспомогательные элементы для того, чтобы вывести текст там, где было задумано дизайнерами и/или разработчиками.</p>
                </div>
            </div>




            <div class="tab-content" id="content-2">
                <div class="halo">
                    <h3>HTML: Теги</h3>
                    <p>Для определения браузером типа элемента, который нужно вывести на страницу, в HTML существуют специальные конструкции — теги. С помощью тегов можно создать параграф, заголовок, секцию текста, а также быстро менять их.</p>
                    <p>Одним из основных тегов является параграф. Он отделяет участки текста друг от друга, что позволяет пользователям комфортнее читать информацию на странице.</p>
                    <p>В HTML параграфы обозначаются специальной конструкцией &lt;p&gt;&lt;/p&gt; внутри которой вставляется нужный текст. Это делается между &lt;p&gt; и &lt;/p&gt;. Такие теги называются парными, так как у них есть открывающая и закрывающая часть. Помимо парных тегов существуют непарные, у них нет закрывающей части, так как внутрь ничего не помещается.</p>
                    <div class="container2">
                        <p>&lt;p&gt;</p>
                        <p>Хекслет — практические курсы по программированию.</p>
                        <p>Мы помогаем новичкам стать профессиональными программистами,</p>
                        <p>а опытным разработчикам получать новые знания и расти профессионально.</p>
                        <p>&lt;/p&gt;</p>
                    </div>
                    <p>Таких параграфов на странице может быть несколько — это не уникальный элемент.</p>                    
                    <div class="container2">
                        <p>&lt;p&gt;Хекслет — практические курсы по программированию.&lt;/p&gt;</p>
                        <p>&lt;p&gt;</p>
                        <p>Мы помогаем новичкам стать профессиональными программистами, а опытным разработчикам получать новые знания и расти профессионально.</p>
                        <p>&lt;/p&gt;</p>
                    </div>
                    <p>Забегая немного вперёд, хочется отметить, что браузеры, по умолчанию, выводят многие теги с заранее определёнными стилями. Например, параграфы имеют стандартные отступы сверху и снизу, чтобы визуально отделять их друг от друга. Прошлый пример в браузере выглядит так:</p>
                    <div class="container2">
                        <p>Хекслет — практические курсы по программированию.</p>
                        <p>Мы помогаем новичкам стать профессиональными программистами, а опытным разработчикам получать новые знания и расти профессионально.</p>
                    </div>
                    <p>Используя CSS можно менять эти стили и добавлять новые. Изучению этого языка посвящён отдельный курс на сайте.</p>
                </div>
            </div>




            <div class="tab-content" id="content-3">
                <div class="halo">
                    <h3>HTML: Текст в HTML</h3>
                    <p>Внутри браузера или другой программы, которая может обрабатывать HTML, текст выводится на основе указанных тегов. Без них браузер не поймёт, как правильно вывести текст.</p>
                    <p>Посмотрим на пример текста и попробуем вывести его используя разметку тегами и без этого.</p>
                    <p>Текст:</p>
                    <div class="container2">
                        <p>Мы считаем, что настоящий программист должен понимать, как работает компьютер, и обладать вычислительным мышлением. Он должен видеть проблему, а не задание. Должен уметь анализировать и рассуждать на уровне проблемы и выше, а не только на уровне кода.</p>
                        <p>При сегодняшнем обилии учебных материалов, курсов и книг, главный вопрос, который встает перед новичком — это не «где учиться?», а «что и в каком порядке учить?». Существует множество мнений по этому поводу. Кто-то советует начинать с математики, кто-то советует конкретные языки и технологии.</p>
                        <p>Хекслет — это готовый путь от абсолютного новичка до первого трудоустройства.</p>
                    </div>
                    <p>Если вставить текст на страницу без использования тегов, то получим такой результат:</p>
                    <div class="container2">
                        <p>Мы считаем, что настоящий программист должен понимать, как работает компьютер, и обладать вычислительным мышлением. Он должен видеть проблему, а не задание. Должен уметь анализировать и рассуждать на уровне проблемы и выше, а не только на уровне кода. При сегодняшнем обилии учебных материалов, курсов и книг, главный вопрос, который встает перед новичком — это не «где учиться?», а «что и в каком порядке учить?». Существует множество мнений по этому поводу. Кто-то советует начинать с математики, кто-то советует конкретные языки и технологии. Хекслет — это готовый путь от абсолютного новичка до первого трудоустройства.</p>
                    </div>
                    <p>Это не тот результат, который ожидался — строки слиплись и превратились в одну нечитаемую строку. Для того, чтобы текст выглядел так, как задумано, его необходимо обернуть в теги &lt;p&gt;:</p>
                    <div class="container2">
                        <p>&lt;p&gt;Мы считаем, что настоящий программист должен понимать, как работает компьютер, и обладать вычислительным мышлением. Он должен видеть проблему, а не задание. Должен уметь анализировать и рассуждать на уровне проблемы и выше, а не только на уровне кода.&lt;/p&gt;</p>
                        <p>&lt;p&gt;При сегодняшнем обилии учебных материалов, курсов и книг, главный вопрос, который встает перед новичком — это не «где учиться?», а «что и в каком порядке учить?». Существует множество мнений по этому поводу. Кто-то советует начинать с математики, кто-то советует конкретные языки и технологии.&lt;/p&gt;</p>
                        <p>&lt;p&gt;Хекслет — это готовый путь от абсолютного новичка до первого трудоустройства.&lt;/p&gt;</p>
                    </div>
                    <p></p>
                    <div class="container2">
                        <p>Мы считаем, что настоящий программист должен понимать, как работает компьютер, и обладать вычислительным мышлением. Он должен видеть проблему, а не задание. Должен уметь анализировать и рассуждать на уровне проблемы и выше, а не только на уровне кода.</p>
                        <p>При сегодняшнем обилии учебных материалов, курсов и книг, главный вопрос, который встает перед новичком — это не «где учиться?», а «что и в каком порядке учить?». Существует множество мнений по этому поводу. Кто-то советует начинать с математики, кто-то советует конкретные языки и технологии.</p>
                        <p>Хекслет — это готовый путь от абсолютного новичка до первого трудоустройства.</p>
                    </div>
                    <p>Пример иллюстрирует, что оформленный текст в офисном редакторе при открытии в браузере станет одной сплошной строкой, поэтому информация размечается специальными тегами. В процессе прохождения курса рассмотрим теги для создания таблиц, списков, ссылок и логических секций страницы. В этом же уроке мы подробнее рассмотрели параграфы и важность разметки для правильного вывода информации на странице</p>
                </div>
            </div>




            <div class="tab-content" id="content-4">
                <div class="halo">
                    <h3>HTML: Вложенность тегов</h3>
                    <p>Важной концепцией HTML является вложенность тегов. Внутрь HTML-тега можно помещать не только текст, как было ранее, но и другие теги. Это позволяет создавать сложную вёрстку, в которой области отделены друг от друга: меню от шапки сайта, рекламный блок от основного контента и так далее.</p>
                    <p>Некоторые элементы в HTML требуют вложенности одних тегов в другие. Например, списки:</p>
                    <div class="container2">
                        <p>&lt;ul&gt;</p>
                        <p>&lt;li&gt;Первый элемент списка&lt;/li&gt;</p>
                        <p>&lt;li&gt;Второй элемент списка&lt;/li&gt;</p>
                        <p>&lt;/ul&gt;</p>
                    </div>
                    <p></p>
                    <div class="container2">
                        <ul>
                            <li class="hal">Первый элемент списка</li>
                            <li class="hal">Второй элемент списка</li>
                        </ul>
                    </div>
                    <p>Для определения списка используется тег &lt;ul&gt;, который указывает, что это маркированный список. Внутри располагаются теги &lt;li&gt;, определяющие элементы нашего списка.</p>
                    <p>Такие вложенности похожи на деревья, где есть вершина дерева (тег &lt;ul&gt;) и листья (теги &lt;li&gt;)</p>
                    <div class="container2">
                        <p>|──ul</p>
                        <p>| |──li</p>
                        <p>| |──li</p>
                    </div>
                    <hr>
                    <p><b>Интересно:</b> тег, внутри которого вложены другие теги, ещё называют обёрткой или враппером/wrapper</p>
                    <p>Дерево может разрастаться и дальше. В уроках про списки будет показано, что внутри элементов списка могут располагаться другие списки и этот процесс почти бесконечен.</p>
                    <p>Но бывают и исключения. В HTML нельзя вкладывать параграфы в параграфы. Пример ниже будет неправильным:</p>
                    <div class="container2">
                        <p>&lt;p&gt;Параграф</p>
                        <p>&lt;p&gt;А вот ещё параграф внутри параграфа&lt;/p&gt;</p>
                        <p>Параграф недоволен таким соседством</p>
                        <p>&lt;/p&gt;</p>
                    </div>
                    <p>В этом уроке мы познакомились с концепцией вложенности тегов в HTML и рассмотрели её на примере создания маркированных списков. В процессе прохождения курса вы изучите множество ситуаций, когда вложенность является лучшим решением, а так же узнаете о тегах, которые нельзя вкладывать друг в друга</p>
                </div>
            </div>
            
            
            
            
            <div class="tab-content" id="content-5">
                <div class="halo">
                    
                        <h3>HTML: Атрибуты HTML</h3>
                        <p>Разметка информации на странице включает в себя множество тонкостей и нюансов. Например, можно задавать не только тип элемента, но и передавать дополнительную информацию, которая будет обработана браузером. Наведите курсор на текст ниже:</p>
                        <div class="container2">
                        <p>Наведите курсор мыши на эту строку текста. Лучше сделать это с компьютера</p>
                        </div>
                        <p>При наведении мыши на элемент появилось небольшое окно с текстом «Всплывающая подсказка. Здесь можно указать дополнительную информацию». Такое поведение задаётся с помощью атрибутов — специальных конструкций, которые могут влиять на вывод информации на странице. Каждый тег в HTML имеет несколько стандартных атрибутов, которые записываются по шаблону атрибут="значение", где:</p>
                        <ul>
                            <li class="hal"><b>Атрибут</b> — название атрибута. Для появления всплывающей подсказки использовался атрибут title</li>
                            <li class="hal"><b>Значение</b> — значение атрибута. Оно может быть разным, в зависимости от самого атрибута. В примере, в качестве значения, использовался текст, который должен быть выведен при наведении на элемент</li>
                        </ul>
                        <p>Разметка примера со всплывающей подсказкой:</p>
                        <div class="container2">
                        <p>&lt;p title="Всплывающая подсказка. Здесь можно указать дополнительную информацию"&gt;Наведите курсор мыши на эту строку текста. Лучше сделать это с компьютера&lt;/p&gt;</p>
                        </div>
                        <p>Атрибут title можно использовать не только на параграфах, а на любом элементе страницы. Такие атрибуты называются глобальными, так как не зависят от элемента. В противовес им есть атрибуты, которые уникальны для одного или нескольких тегов. Например, атрибут colspan, который указывает на объединение ячеек в таблицах. Его использование вне таблиц не имеет никакого смысла.</p>
                        <p>Атрибуты могут неявно влиять на вывод информации. Например, при использовании языка стилей CSS, встречается атрибут class, задача которого — отделить похожие элементы друг от друга с помощью значения атрибута. О работе классов вы узнаете из курса по CSS, а сейчас важно знать, что этот атрибут никак не проявляет себя при выводе информации на страницу</p>
                        <div class="container2">
                            <p>&lt;p class="lead"&gt;Параграф с классом lead&lt;/p&gt;</p>
                            <p>&lt;p class="mega-paragraph"&gt;Параграф с классом mega-paragraph&lt;/p&gt;</p>
                        </div>
                        <p>У одного тега может быть указано сразу несколько атрибутов. Тогда они записываются последовательно, при этом порядок указания не имеет значения:</p>
                        <div class="container2">
                            <p>&lt;p class="text-center" title="Этот элемент имеет несколько атрибутов"&gt;Параграф с несколькими атрибутами&lt;/p&gt;</p>
                        </div>
                        <p>В этом уроке мы изучили понятие атрибута и их запись. Изучили работу атрибутов title и class, а также узнали о том, что атрибуты бывают глобальные и уникальные для HTML-элементов. Глобальные атрибуты могут быть использованы для любого тега, тогда как уникальные только для определённых</p>
                        
                </div>
            </div>
        </div>
    </div> 
</template>
<script> 

</script>
<style> 
.lag{
    margin-left: 400px;
    height: 2000px;
    width: 1000px;
    border: 2px;
}
.tab {
    
    display: flex;
    flex-wrap: wrap;
}

.tab > input[type="radio"] {
    display: none;
}
.tab-content {
    
    display: none;
    width: 100%;
    margin-top: 1rem;
}
#tab-btn-111:checked~#content-1,
#tab-btn-222:checked~#content-2,
#tab-btn-333:checked~#content-3,
#tab-btn-444:checked~#content-4,
#tab-btn-555:checked~#content-5 {
    display: block;
}
.tab > label {
    display: block;
    padding: 0.5rem 1rem;
    cursor: pointer;
    transition: color .15s ease-in-out,background-color .15s ease-in-out,border-color .15s ease-in-out;
    text-decoration: none;
    color: #0d6efd;
    border: 0;
    border-radius: 0.375rem;
    background: 0 0;
}

.tab > input[type="radio"]:checked + label {
    cursor: default;
    color: #fff;
    background-color: #0d6efd;
}
.halo{
    margin: 50px
}
.hal{
    text-align: left;
}
.mag{
    margin: 50px;
    text-align: left
}
.container {
  width: 80%;
  margin: 0 auto;
  padding: 15px;
  background-color: #474747;
  border-top-left-radius: 10px;
  border-top-right-radius: 10px;

}
.container1 {
  width: 80%;
  margin: 0 auto;
  padding: 10px;
  background-color: #c9c9c9;
  text-align: left;
}
.container2{
    width: 80%;
    margin: 0 auto;
    padding: 10px;
    background-color: #eeeeee;
    text-align: left;
    border-top-left-radius: 10px;
    border-top-right-radius: 10px;
}
</style>