<template>
    <div class="pak">
        <h1>Основы JavaScript</h1>
        <div class="mag">
            <h3>ВВЕДЕНИЕ</h3>
            <p>JavaScript — один из самых широко используемых языков. Он применяется в разработке игр, создании Web-приложений. Профессия «Frontend-разработчик» на Хекслете дает все необходимые знания и навыки для трудоустройства. Именно с этого курса начинается погружение в сам язык.</p>

            <p>В курсе даются основы программирования на JavaScript. Мы познакомимся с такими понятиями как представление данных в памяти, стандарты именования, кодирование строк и многими другими. Изучение основ программирования с самого нуля требует особого способа организации учебного материала. Необходимо первичное привыкание к языковым конструкциям, погружение в язык.</p>
        </div>
        <div class="tab">
            <input checked id="tab-btn-11" name="tab-btn" type="radio" value="">
            <label for="tab-btn-11">Привет, Мир!</label>
            <input id="tab-btn-22" name="tab-btn" type="radio" value="">
            <label for="tab-btn-22">Комментарии</label>
            <input id="tab-btn-33" name="tab-btn" type="radio" value="">
            <label for="tab-btn-33">Инструкции(Statements)</label>
            <input id="tab-btn-44" name="tab-btn" type="radio" value="">
            <label for="tab-btn-44">Как мы проверяем ваши решения</label>
            <input id="tab-btn-55" name="tab-btn" type="radio" value="">
            <label for="tab-btn-55">Ощибки оформления</label>



            <div class="tab-content" id="content-1">
                <div class="halo">
                    <h3>JavaScript: Привет, Мир!</h3>
                    <p>Изучение нового языка программирования традиционно начинается с 'Hello, World!'. Это простая программа, которая выводит приветствие на экран и заодно знакомит с новым языком — его синтаксисом и структурой программы. Этой традиции уже больше сорока лет, поэтому и мы не будем ее нарушать — в первом же уроке напишем программу Hello, World!.</p>
                    <p>Эта программа будет выводить на экран текст:</p>
                    <div class="container"></div>
                    <div class="container1">Hello, World!</div>
                    <p>На языке Java эта программа будет выглядеть так:</p>
                    <p>Чтобы вывести что-то на экран, нужно дать компьютеру специальную команду. В языке JavaScript такая команда — console.log().</p>

                </div>
            </div>




            <div class="tab-content" id="content-2">
                <div class="halo">
                    <h3>JavaScript: Комментарии</h3>
                    <p>Это текст, который не является частью программы и нужен программистам для пометок. С их помощью добавляют пояснения, как работает код, какие здесь ошибки нужно поправить или не забыть что-то добавить позже</p>
                    <div class="container2">
                        <p>// Удалить строку ниже после реализации задачи по регистрации</p>
                        <p>console.log(10);</p>
                    </div>
                    <p>Комментарии в JavaScript бывают двух видов:</p>                    
                    <li class="hal"><b>Однострочные комментарии</b></li>
                    <p>Однострочные комментарии начинаются с //. После этих двух символов может следовать любой текст, вся строчка не будет анализироваться и исполняться.</p>
                    <p>Комментарий может занимать всю строчку. Если одной строчки мало, то создаются несколько комментариев:</p>
                    <div class="container2">
                        <p>// For Winterfell!</p>
                        <p> // For Lanisters!</p>
                    </div>
                    <p>Комментарий может находиться на строчке после какого-нибудь кода:</p>
                    <div class="container2">
                        <p>console.log('I am the King'); // For Lannisters!</p>
                    </div>

                    <li class="hal"><b>Многострочные комментарии</b></li>
                    <p>Многострочные комментарии начинаются с /* и заканчиваются на */.</p>
                    <div class="container2">
                        <p>/*</p>
                        <p>  The night is dark and</p>
                        <p>  full of terrors.</p>
                        <p>*/</p>
                        <p>console.log('I am the King');</p>
                    </div>
                    <p>Такие комментарии, обычно, используют для документирования кода, например, функций.</p>
                </div>
            </div>




            <div class="tab-content" id="content-3">
                <div class="halo">
                    <h3>JavaScript: Инструкции (Statements)</h3>
                    <p>Инструкция — это команда для компьютера выполнить что-то. Код на JavaScript — это набор инструкций, которые, как правило, отделяются друг от друга символом ;.</p>
                    <p>Вот пример кода с двумя инструкциями.</p>
                    <div class="container2">
                        <p>console.log('Mother of Dragons.');</p>
                        <p>console.log('Dracarys!');</p>
                    </div>
                    <p>При запуске этого кода, на экран последовательно выводятся два предложения:</p>
                    <div class="container"></div>
                    <div class="container1">
                        <p>Mother of Dragons.</p>
                        <p>Dracarys!</p>
                    </div>
                    <p>Теоретически, инструкции можно написать друг за другом без переноса на новую строчку:</p>
                    <div class="container2">
                        <p>console.log('Mother of Dragons.'); console.log('Drakarys!');</p>
                    </div>
                    <p>Результат на экране будет таким же, но такой код неудобен для чтения, поэтому инструкции располагают друг под другом.</p>
                    <p>Почему это важно знать? Инструкция — это единица исполнения. Интерпретатор, программа которая запускает код на JavaScript, выполняет инструкции строго по очереди. И мы, как разработчики, должны понимать этот порядок и уметь мысленно разделять программу на независимые части, удобные для анализа.</p>
                </div>
            </div>




            <div class="tab-content" id="content-4">
                <div class="halo">
                    <h3>JavaScript: Как мы проверяем ваши решения</h3>
                    <p>Сайт автоматически проверяет ваши решения. Как это работает?</p>
                    <p>В самом простом случае, система просто запускает ваш код и смотрит на то, что вывелось на экран. А потом сверяет с тем, что мы «ожидали» по заданию.</p>
                    <p>В следующих, более сложных уроках, вы будете писать функции — некие мини-программы, принимающие информацию из внешнего мира и производящие какие-то операции. Проверка ваших решений в таких случаях выглядит немного сложнее: система запускает ваше решение и передаёт какую-то информацию. Система также знает — «ожидает» — какой именно ответ должна дать правильная функция при таких входных данных.</p>
                    <p>Например, если ваша задача — написать функцию сложения двух чисел, то проверочная система будет передавать ей разные комбинации чисел и сверять ответ вашей функции с реальными суммами. Если во всех случаях ответы совпадут, то решение считается верным.</p>
                    <p>Такой подход называется тестированием, и он используется в реальной повседневной разработке. Обычно программист сначала пишет тест — проверочную программу, а потом уже ту программу, которую хотел написать. В процессе он постоянно запускает тесты и смотрит, приблизился ли он к решению.</p>
                    <p>Именно поэтому наш сайт говорит «Тесты пройдены», когда вы правильно решили задачу.</p>
                    <p>Вот простой пример: в одном из будущих уроков вам нужно будет написать функцию, которая производит вычисления и выдаёт ответ. Предположим, вы допустили небольшую ошибку, и функция выдала неправильное число. Система ответит примерно так:</p>
                    <div class="container"></div>
                    <div class="container1">
                        <p>test</p>
                        <p>expect(received).toBe(expected) // Object.is equality</p>
                        <p> Expected value to be:</p>
                        <p>"Hello, World!"</p>
                        <p>Received:</p>
                        <p>"ello, World!"</p>
                    </div>
                    <p>Самое главное начинается после двоеточия: «ожидалось: "35", но было "10"». То есть правильный код должен был выдать 35, но текущее решение работает неправильно и выдаёт 10.</p>
                    <p>Кроме наших тестов, будет крайне полезно использовать сервис repl.it.</p>
                    <hr>
                    <p>Иногда в процессе решения будет казаться, что вы сделали все правильно, но система "капризничает" и не принимает решение. Подобное поведение практически исключено. Нерабочие тесты просто не могут попасть на сайт, они автоматически запускаются после каждого изменения. В подавляющем большинстве таких случаев, (а все наши проекты в сумме провели миллионы проверок за много лет), ошибка содержится в коде решения. Она может быть очень незаметной, вместо английской буквы случайно ввели русскую, вместо верхнего регистра использовали нижний или забыли вывести запятую. Другие случаи сложнее. Возможно ваше решение работает для одного набора входных данных, но не работает для другого. Поэтому всегда внимательно читайте условие задачи и вывод тестов. Там почти наверняка есть указание на ошибку.</p>
                    <p>Однако, если вы уверены в ошибке или нашли какую-то неточность, то вы всегда можете указать на нее. В конце каждой теории есть ссылка на содержимое урока на гитхабе (этот проект полностью открытый!). Перейдя туда, вы можете написать issue, посмотреть содержимое тестов (там видно, как вызывается ваш код) и даже отправить pullrequest.</p>
                </div>
            </div>
            
            
            
            
            <div class="tab-content" id="content-5">
                <div class="halo">
                    
                        <h3>JavaScript: Как мы проверяем ваши решения</h3>
                        <p>Если программа на JavaScript написана синтаксически некорректно, то интерпретатор выводит на экран соответствующее сообщение, а также указание на файл и строчку в нём, где, по его мнению, произошла ошибка. Синтаксическая ошибка возникает в том случае, когда код был записан с нарушением грамматических правил. В человеческих языках грамматика важна, но текст с ошибками чаще всего можно понять и прочитать. В программировании всё строго. Любое мельчайшее нарушение, и программа даже не запустится. Примером может быть забытая ;, неправильно расставленные скобки и другие детали.</p>
                        <p>Вот пример кода с синтаксической ошибкой:</p>
                        <div class="container2">
                        <p>console.log('Hodor'</p>
                        </div>
                        <p>Если запустить код выше, то мы увидим следующее сообщение: SyntaxError: missing ) after argument list, а также указание на строку и файл, где возникла эта ошибка. Подобные синтаксические ошибки в JavaScript относятся к разряду SyntaxError.</p>
                        <p>По техническим причинам, такой код, запущенный на https://code-basics.com не укажет на строку и файл. Проверить этот вывод можно на https://repl.it</p>
                        <p>С одной стороны, ошибки SyntaxError — самые простые, потому что они связаны исключительно с грамматическими правилами написания кода, а не с самим смыслом кода. Их легко исправить: нужно лишь найти нарушение в записи.</p>
                        <p>С другой стороны, интерпретатор не всегда может чётко указать на это нарушение. Поэтому бывает, что забытую скобку нужно поставить не туда, куда указывает сообщение об ошибке.</p>
                        
                </div>
            </div>
        </div>
    </div>
</template>
<script>

</script>
<style>
.pak{
    margin-left: 400px;
    height: 1700px;
    width: 1000px;
    border: 2px;
}
.tab {
    
    display: flex;
    flex-wrap: wrap;
}

.tab > input[type="radio"] {
    display: none;
}
.tab-content {
    
    display: none;
    width: 100%;
    margin-top: 1rem;
}
#tab-btn-11:checked~#content-1,
#tab-btn-22:checked~#content-2,
#tab-btn-33:checked~#content-3,
#tab-btn-44:checked~#content-4,
#tab-btn-55:checked~#content-5 {
    display: block;
}
.tab > label {
    display: block;
    padding: 0.5rem 1rem;
    cursor: pointer;
    transition: color .15s ease-in-out,background-color .15s ease-in-out,border-color .15s ease-in-out;
    text-decoration: none;
    color: #0d6efd;
    border: 0;
    border-radius: 0.375rem;
    background: 0 0;
}

.tab > input[type="radio"]:checked + label {
    cursor: default;
    color: #fff;
    background-color: #0d6efd;
}
.halo{
    margin: 50px
}
.hal{
    text-align: left;
}
.mag{
    margin: 50px;
    text-align: left
}
.container {
  width: 80%;
  margin: 0 auto;
  padding: 15px;
  background-color: #474747;
  border-top-left-radius: 10px;
  border-top-right-radius: 10px;

}
.container1 {
  width: 80%;
  margin: 0 auto;
  padding: 10px;
  background-color: #c9c9c9;
  text-align: left;
}
.container2{
    width: 80%;
    margin: 0 auto;
    padding: 10px;
    background-color: #eeeeee;
    text-align: left;
    border-top-left-radius: 10px;
    border-top-right-radius: 10px;
}
</style>