<template>
    <div class="jb">
        <h1>Основы Java</h1>
        <div class="mag">
            <h3>ВВЕДЕНИЕ</h3>
            <p>Java — язык программирования общего назначения, который является одним из самых востребованных языков. Он используется для создания приложений в разных областях: в вебе, разработке игр, мобильного ПО, и даже программ для корпораций и научных институтов.</p>
            <p>Подавляющее большинство крупных компаний так или иначе используют Java. Очень много серверных приложений для корпораций написаны на этом языке. Например, речь идет о программах для финансовых организаций, которые обеспечивают проведение транзакций, фиксацию торговых операций.</p>
            <p>На Java написано много веб-приложений. Популярные фреймворки, в том числе Spring, Struts, JSP, используются для создания разных приложений в вебе: от ecommerce-проектов до крупных порталов, от образовательных платформ до правительственных ресурсов. Потому работу на Java можно найти практически везде. Профессия Java-разработчик на Хекслете дает все необходимые знания и навыки для трудоустройства, и именно с этого курса начинается погружение в сам язык.</p>
        </div>
        <div class="tab">
            <input checked id="tab-btn-1" name="tab-btn" type="radio" value="">
            <label for="tab-btn-1">Привет, Мир!</label>
            <input id="tab-btn-2" name="tab-btn" type="radio" value="">
            <label for="tab-btn-2">Комментарии</label>
            <input id="tab-btn-3" name="tab-btn" type="radio" value="">
            <label for="tab-btn-3">Инструкции(Statements)</label>
            <input id="tab-btn-4" name="tab-btn" type="radio" value="">
            <label for="tab-btn-4">Как мы проверяем ваши решения</label>
            <input id="tab-btn-5" name="tab-btn" type="radio" value="">
            <label for="tab-btn-5">Ощибки оформления</label>



            <div class="tab-content" id="content-1">
                <div class="halo">
                    <h3>Java: Привет мир!</h3>
                    <p>Изучать язык программирования по традиции начинают с программы "Hello, World!", которая выводит этот текст на экран.</p>
                
                    <div class="container"></div>
                    <div class="container1">Hello, World!</div>
                    <p>На языке Java эта программа будет выглядеть так:</p>
                    <div class="container2">
                        <p>class App {</p>
                        <p>     public static void main(String[] args) {</p>
                        <p>        System.out.println("Hello, World!");</p>
                        <p>    }</p>
                        <p>}</p>
                    </div>
                
                    <p>Текст Hello, World! появится на экране благодаря команде System.out.println(), где println() — это сокращение от английского print line. 
                    Она выводит на экран значение, указанное в скобках ("Hello, World!") — в данном случае строку. Сама строка обрамляется двойными кавычками "". 
                    Если этого не сделать, то компилятор укажет на синтаксическую ошибку:</p>
                
                    <div class="container2">
                        <p># Например, вот так{</p>
                        <p>     App.java:5: error: unclosed character literal</p>
                        <p>        System.out.println('Hello, World!');</p>
                    </div>
                    <p>Сама команда находится внутри нескольких конструкций, которые нужны для работы даже простейших программ на Java.
                        В данном случае это класс App и метод main().</p>
                    <p>Сейчас мы не будем на них останавливаться, так как для их понимания нужно уметь немного программировать. 
                        Поэтому во многих заданиях они даются «как есть», то есть вам не придется их задавать самостоятельно. Когда придет время, мы их разберем.</p>
                </div>
            </div>




            <div class="tab-content" id="content-2">
                <div class="halo">
                    <h3>Java: Комментарии</h3>
                    
                    <p>Практически все языки программирования позволяют оставлять в коде комментарии. 
                        Они никак не используются кодом и нужны исключительно для людей: 
                        чтобы программист оставлял пометки для себя и для других программистов.</p>
                    
                        <p>Комментарии в Java бывают трех видов:</p>
                    
                    <li class="hal"><b>Однострочные комментарии</b> начинаются с //. После этих двух символов может следовать любой текст, вся строка не будет анализироваться и исполняться.</li>
                    
                    <p>Комментарий может занимать всю строку:</p>
                    
                    <div class="container2">
                        <p>// For Winterfell!</p>
                    </div>
                
                    <p>Также комментарий может находиться на строке после какого-нибудь кода:</p>
                
                    <div class="container2">
                        <p>System.out.println("I am the King"); // => For Lannisters!</p>
                    </div>
                    
                    <li class="hal"><b>Многострочные комментарии</b> начинаются с /* и заканчиваются на */. Принято каждую строку начинать с символа *, хотя технически это и необязательно:</li>
                    
                    <div class="container2">
                        <p>/*</p>
                        <p>* The night is dark and</p>
                        <p>* full of terrors.</p>
                        <p>*/</p>
                        <p>System.out.println("I am the King"); // => I am the King</p>
                    
                    </div>
                    <li class="hal"><b>Документирующие комментарии</b> начинаются с /** и заканчиваются на */. Уже для них обязательно каждую строку начинать с символа *.</li>
                    <p>Документирующие комментарии — это подвид многострочных. При этом несут дополнительную функцию — их можно собрать при помощи специальной утилиты javadoc и выдать в качестве документации к вашему коду. Мы поговорим о них позже – когда разберем классы и методы.</p>
                </div>
            </div>




            <div class="tab-content" id="content-3">
                <div class="halo">
                    <h3>Java: Инструкции (Statements)</h3>
                    <p>Инструкция — это команда для компьютера. Код на Java — это набор инструкций, которые, обычно, отделяются друг от друга символом ;. Вот пример кода с двумя инструкциями:</p>
                
                    <div class="container2">
                        <p>System.out.println("Mother of Dragons");</p>
                        <p>System.out.println("Dracarys!");</p>
                    </div>
                
                    <p>При запуске этого кода на экран последовательно выводятся два предложения:</p>
                
                    <div class="container"></div>
                    <div class="container1">
                        <p>Mother of Dragons</p>
                        <p>Dracarys!</p>
                    </div>
                    <p>Почему это важно знать? Инструкция — это единица исполнения. Программа, которая запускает код на Java, выполняет инструкции строго по очереди. Разработчики должны понимать этот порядок и уметь мысленно разделять программу на независимые части, удобные для анализа.</p>
                    <p>Теоретически инструкции можно написать последовательно друг за другом без переноса на новую строчку:</p>

                    <div class="container2">
                        <p>System.out.println("Mother of Dragons."); System.out.println("Dracarys!");</p>
                    </div>
                    <p>Результат на экране будет таким же, но на практике такой подход считается плохим.</p>
                </div>
            </div>




            <div class="tab-content" id="content-4">
                <div class="halo">
                    <h3>Java: Как мы проверяем ваши решения</h3>
                    <p>Наш сайт автоматически проверяет ваши решения. Как это работает?</p>
                    <p>В самом простом случае система просто запускает ваш код и смотрит на то, что вывелось на экран. А потом сверяет с тем, что мы «ожидали» по заданию.</p>
                    <p>В следующих, более сложных уроках вы будете писать методы — некие мини-программы, принимающие информацию из внешнего мира и производящие какие-то операции. Проверка ваших решений в таких случаях выглядит немного сложнее: система запускает ваше решение и передаёт какую-то информацию. Система также знает — «ожидает» — какой именно ответ должен вернуть правильный метод при таких входных данных.</p>
                    <p>Например, если ваша задача — написать код для сложения двух чисел, то проверочная система будет передавать ему разные комбинации чисел и сверять ответ вашего кода с реальными суммами. Если во всех случаях ответы совпадут, то решение считается верным.</p>
                    <p>Вот простой пример: в одном из будущих уроков вам нужно будет написать код, который производит вычисления и выдаёт ответ. Допустим, вы допустили небольшую ошибку, и метод выдал неправильное число. Система ответит примерно так:</p>
                    <li class="hal"><b>Многострочные комментарии</b> начинаются с /* и заканчиваются на */. Принято каждую строку начинать с символа *, хотя технически это и необязательно:</li>
                    <div class="container"></div>
                    <div class="container1">expected: "35" but was: "10"</div>
                    <p>Самое главное начинается после двоеточия: «ожидалось: "35", но было "10"». То есть правильный код должен был выдать 35, но текущее решение работает неправильно и выдаёт 10.</p>
                    <p>Кроме наших тестов, будет крайне полезно использовать сервис repl.it.</p>
                    <hr>
                    <p>Иногда в процессе решения будет казаться, что вы сделали все правильно, но система "капризничает" и не принимает решение. Подобное поведение практически исключено. Нерабочие тесты просто не могут попасть на сайт, они автоматически запускаются после каждого изменения. В подавляющем большинстве таких случаев, (а все наши проекты в сумме провели миллионы проверок за много лет), ошибка содержится в коде решения. Она может быть очень незаметной, вместо английской буквы случайно ввели русскую, вместо верхнего регистра использовали нижний или забыли вывести запятую. Другие случаи сложнее. Возможно ваше решение работает для одного набора входных данных, но не работает для другого. Поэтому всегда внимательно читайте условие задачи и вывод тестов. Там почти наверняка есть указание на ошибку.</p>
                    <p>Однако, если вы уверены в ошибке или нашли какую-то неточность, то вы всегда можете указать на нее. В конце каждой теории есть ссылка на содержимое урока на гитхабе (этот проект полностью открытый!). Перейдя туда, вы можете написать issue, посмотреть содержимое тестов (там видно, как вызывается ваш код) и даже отправить pullrequest.</p>
                </div>
            </div>
            
            
            
            
            <div class="tab-content" id="content-5">
                <div class="halo">
                    
                        <h3>Java: Как мы проверяем ваши решения</h3>
                        <p>В человеческих языках грамматика важна, но текст с ошибками чаще всего можно понять и прочитать. В программировании все строго. Любое мельчайшее нарушение, и программа не запустится.</p>
                        <p>Примером может быть забытая ;, неправильно расставленные скобки и другие детали. Подобные ошибки называются синтаксическими, потому что они нарушают правила синтаксиса языка.</p>
                        <p>Если программа на Java написана синтаксически некорректно, то компилятор выводит на экран:</p>
                        <li class="hal">Сообщение об ошибке</li>
                        <li class="hal">Указание на файл</li>
                        <li class="hal">Строчка в файле, где по его мнению произошла ошибка</li>
                        <p>Ниже пример кода с синтаксической ошибкой:</p>
                        <div class="container2">
                        <p>System.out.println("alala</p>
                        </div>
                        <p>Если запустить код выше, то мы увидим следующее сообщение:</p>
                        <div class="container"></div>
                        <div class="container1">
                            <p>|  Error:</p>
                            <p>|  unclosed string literal</p>
                            <p>|  System.out.println("alala</p>
                        </div>
                        <p>С одной стороны, ошибки синтаксиса — самые простые, потому что они связаны исключительно с грамматическими правилами написания кода, а не с самим смыслом кода. Их легко исправить — нужно лишь найти нарушение в записи.</p>
                        <p>С другой стороны, компилятор не всегда может четко указать на это нарушение. Поэтому бывает, что забытую скобку нужно поставить не туда, куда указывает сообщение об ошибке.</p>
                </div>
            </div>
        </div>
    </div>
</template>
<script>

</script>
<style>

.jb{
    margin-left: 400px;
    height: 1500px;
    width: 1000px;
    border: 2px;
}
.tab {
    
    display: flex;
    flex-wrap: wrap;
}

.tab > input[type="radio"] {
    display: none;
}

.tab-content {
    
    display: none;
    width: 100%;
    margin-top: 1rem;
}

#tab-btn-1:checked~#content-1,
#tab-btn-2:checked~#content-2,
#tab-btn-3:checked~#content-3,
#tab-btn-4:checked~#content-4,
#tab-btn-5:checked~#content-5 {
    display: block;
}

.tab > label {
    display: block;
    padding: 0.5rem 1rem;
    cursor: pointer;
    transition: color .15s ease-in-out,background-color .15s ease-in-out,border-color .15s ease-in-out;
    text-decoration: none;
    color: #0d6efd;
    border: 0;
    border-radius: 0.375rem;
    background: 0 0;
}

.tab > input[type="radio"]:checked + label {
    cursor: default;
    color: #fff;
    background-color: #0d6efd;
}
.mag{
    margin: 50px;
    text-align: left
}
.halo{
    margin: 50px
}
.hal{
    text-align: left;
}

.container {
  width: 80%;
  margin: 0 auto;
  padding: 15px;
  background-color: #474747;
  border-top-left-radius: 10px;
  border-top-right-radius: 10px;

}
.container1 {
  width: 80%;
  margin: 0 auto;
  padding: 10px;
  background-color: #c9c9c9;
  text-align: left;
}
.container2{
    width: 80%;
    margin: 0 auto;
    padding: 10px;
    background-color: #eeeeee;
    text-align: left;
    border-top-left-radius: 10px;
    border-top-right-radius: 10px;
}
  
</style>