<template>
	<div class="nuk">
        <h1>Основы PHP</h1>
        <div class="mag">
            <h3>ВВЕДЕНИЕ</h3>
            <p>PHP — самый популярный язык для веб-разработки. Работу на нем можно найти практически везде. Именно в PHP чаще принято набирать начинающих разработчиков.</p>
            <p>Профессия PHP-программист на Хекслете дает необходимые знания и навыки для трудоустройства. С этого курса начинается погружение в сам язык.</p>
            <p>В курсе даются основы программирования на PHP и объясняются представление данных в памяти, стандарты именования, кодирование строк, тестирование, побочные эффекты, представление времени в компьютере и многое другое.</p>
        </div>
        <div class="tab">
            <input checked id="tab-btn-11" name="tab-btn" type="radio" value="">
            <label for="tab-btn-11">Привет, Мир!</label>
            <input id="tab-btn-22" name="tab-btn" type="radio" value="">
            <label for="tab-btn-22">Теги</label>
            <input id="tab-btn-33" name="tab-btn" type="radio" value="">
            <label for="tab-btn-33">Комментарии</label>
            <input id="tab-btn-44" name="tab-btn" type="radio" value="">
            <label for="tab-btn-44">Инструкции(Statements)</label>
            <input id="tab-btn-55" name="tab-btn" type="radio" value="">
            <label for="tab-btn-55">Как мы проверяем ваши решения</label>
            <input id="tab-btn-66" name="tab-btn" type="radio" value="">
            <label for="tab-btn-66">Ощибки оформления</label>



            <div class="tab-content" id="content-1">
                <div class="halo">
                    <h3>PHP: Привет, Мир!</h3>
                    <p>В этом уроке мы сразу напишем первую программу. Мы узнаем, какие команды понадобятся для этого и какие теги нужно использовать, чтобы программа, которая выполняет код, восприняла его. Также узнаем, зачем в коде нужны комментарии.</p>
                    <h3>Как написать простую программу</h3>
                    <p>Чтобы написать программу и вывести результат на экран, используют два способа:</p>
                    <ul>
                        <li class="hal">Через команду echo</li>
                        <li class="hal">Через команду print_r()</li>
                    </ul>
                    <p>Разберем каждую подробнее.</p>
                    <h3>Пишем программу через echo</h3>
                    <p>Напишем программу «Hello, World!». Она будет выводить на экран текст:</p>
                    <div class="container2">
                        <p>&lt;?php</p>
                        <p>echo 'Hello, World!';</p>
                        <p>// => Hello, World!</p>
                    </div>
                    <p>Вывод на экран выполняется с помощью специальной команды echo. После нее в одиночных кавычках указывается строка для вывода. В конце обязательно ставим точку с запятой.</p>
                    <p>Для удобства мы будем показывать результат запуска строк кода так: => РЕЗУЛЬТАТ.</p>
                    <h3>Пишем программу через print_r()</h3>
                    <p>Другой способ вывести строку на экран — функция print_r():</p>
                    <div class="container2">
                        <p>&lt;?php</p>
                        <p>print_r('Hello, World!');</p>
                        <p>// => Hello, World!</p>
                    </div>
                    <p>В этом случае строка указывается в скобках сразу после имени функции. В конце также нужно ставить ;.</p>
                    <p>В простых ситуациях между этими конструкциями нет разницы. Можно использовать любой способ. А там, где на экран нужно выводить не просто числа или строки, а, например, массивы, echo не сможет этого сделать, а print_r() все выведет.</p>
                </div>
            </div>





            <div class="tab-content" id="content-2">
                <div class="halo">
                    <h3>PHP: Теги</h3>
                    <h3>Зачем использовать теги</h3>
                    <p>Чтобы интерпретатор — программа, которая выполняет код, — восприняла его не как обычный текст, любой код на PHP нужно оборачивать в конструкцию ?php ?&gt;. Это особенность данного языка программирования.</p>
                    <p>&lt;?php — это открывающий тег, а ?> — закрывающий тег. PHP позволяет не указывать закрывающую часть ?>. А руководство по оформлению кода PSR-12 запрещает ее указывать.</p>
                </div>
            </div>




            <div class="tab-content" id="content-3">
                <div class="halo">
                    <h3>PHP: Комментарии</h3>
                    <h3>Зачем нужны комментарии</h3>
                    <p>Кроме кода в файлах с исходным кодом могут находиться комментарии. Этот текст не является частью программы. Он нужен программистам для пометок. С их помощью добавляют пояснения, например, как работает код, какие ошибки нужно поправить или не забыть что-то позже добавить.</p>
                    <p>Комментарии в PHP бывают двух видов:</p>
                    <li class="hal"><b>Однострочные комментарии</b> — начинаются с //. После этих символов может следовать любой текст, вся строка не будет анализироваться и исполняться:</li>
                    <div class="container2">
                        <p>&lt;?php</p>
                        <p>// For Winterfell!</p>
                        <p>// For Lanisters!</p>
                        <p>// Комментарий может находиться на строке после какого-нибудь кода</p>
                        <p>print_r('I am the King'); // For Lannisters!</p>
                    </div>                  
                    <li class="hal"><b>Многострочные комментарии</b>— начинаются с /* и заканчиваются на */. Между ними каждая строка должна начинаться с символа *:</li>
                    <div class="container2">
                        <p>?php</p>
                        <p>/*</p>
                        <p>* The night is dark and</p>
                        <p>* full of terrors.</p>
                        <p>*/</p>
                        <p>print_r('I am the King');</p>
                    </div> 
                </div>
            </div>




            <div class="tab-content" id="content-4">
                <div class="halo">
                    <h3>PHP: Инструкции (Statements)</h3>
                    <h3>Что такое инструкция</h3>
                    <p><b>Инструкция</b> — это команда, которую исполняет интерпретатор PHP. Она написана на языке программирования. Ее можно сравнить с инструкцией или рецептом по приготовлению блюда:</p>
                    <p>Код на PHP — это набор инструкций, которые отделяются друг от друга символом ;.</p>
                    <p>Вот пример кода с двумя инструкциями:</p>
                    <div class="container2">
                        <p>&lt;?php</p>
                        <p>print_r('Mother of Dragons. ');</p>
                        <p>print_r('Dracarys!');</p>
                        <p>// => Mother of Dragons. Dracarys!</p>
                    </div>
                    <p>При запуске этого кода на экран последовательно выводятся два предложения: Mother of Dragons. Dracarys!.</p>
                    <p>Инструкции можно написать последовательно друг за другом без переноса на новую строчку:</p>
                    <div class="container2">
                        <p>&lt;?php</p>
                        <p>print_r('Mother of Dragons. '); print_r('Drakarys!');</p>
                        <p>// => Mother of Dragons. Dracarys!</p>
                    </div>
                    <p>Результат на экране будет таким же. Но такой код неудобно читать, поэтому инструкции располагают друг под другом.</p>
                </div>
            </div>




            <div class="tab-content" id="content-5">
                <div class="halo">
                    <h3>PHP: Как мы проверяем ваши решения</h3>
                    <p>Наш сайт автоматически проверяет ваши решения. Как это работает?</p>
                    <p>В самом простом случае, система просто запускает код и смотрит на то, что вывелось на экран. А потом сверяет с тем, что мы «ожидали» по заданию.</p>
                    <p>В следующих, более сложных уроках, вы будете писать функции — мини-программы, принимающие информацию из внешнего мира и производящие какие-то операции. Проверка ваших решений в таких случаях выглядит немного сложнее: система запускает ваше решение и передаёт какую-то информацию. Система также знает — «ожидает» — какой именно ответ должна дать правильная функция при таких входных данных.</p>
                    <p>Например, если ваша задача — написать функцию сложения двух чисел, то проверочная система будет передавать ей разные комбинации чисел и сверять ответ вашей функции с реальными суммами. Если во всех случаях ответы совпадут, то решение считается верным.</p>
                    <p>Такой подход называется тестированием, и он используется в реальной повседневной разработке. Обычно программист сначала пишет тест — проверочную программу, а потом уже ту программу, которую хотел написать. В процессе он постоянно запускает тесты и смотрит, приблизился ли он к решению.</p>
                    <p>Именно поэтому наш сайт говорит «Тесты пройдены», когда вы правильно решили задачу.</p>
                    <p>Вот простой пример: необходимо распечатать строку Hello, World!. Предположим, вы допустили небольшую ошибку, и функция вывела на экран другое значение. Система ответит примерно так:</p>
                    <div class="container"></div>
                    <div class="container1">
                        <p>-'Hello, World!'</p>
                        <p>+'ello, World!'</p>
                        <p>FAILURES!</p>
                        <p>Tests: 1, Assertions: 1, Failures: 1.</p>
                    </div>
                    <p>На экране появляется подсказка. На ней знаком + обозначено то, что распечатал ваш код. Знаком - – то, что ожидалось. Сравнивая эти два значения, можно увидеть ошибку. В примере выше видно, что в выводе пропущена буква H.</p>
                    <p>Кроме наших тестов, будет крайне полезно экспериментировать с кодом. Для этого можно использовать сервис repl.it. Идеально, если вы выполните самостоятельно весь код, который присутствует в уроках.</p>
                    <hr>
                    <p>Иногда в процессе решения будет казаться, что вы сделали все правильно, но система «капризничает» и не принимает решение. Подобное поведение практически исключено. Нерабочие тесты просто не могут попасть на сайт, они автоматически запускаются после каждого изменения. В подавляющем большинстве таких случаев, (а все наши проекты в сумме провели миллионы проверок за много лет), ошибка содержится в коде решения. Она может быть очень незаметной, вместо английской буквы случайно ввели русскую, вместо верхнего регистра использовали нижний или забыли вывести запятую. Другие случаи сложнее. Возможно ваше решение работает для одного набора входных данных, но не работает для другого. Поэтому всегда внимательно читайте условие задачи и вывод тестов. Там почти наверняка есть указание на ошибку.</p>
                    <p>Однако, если вы уверены в ошибке или нашли какую-то неточность, то вы всегда можете указать на неё. В конце каждой теории есть ссылка на содержимое урока на гитхабе (этот проект полностью открытый!). Перейдя туда, вы можете написать issue, посмотреть содержимое тестов (там видно, как вызывается ваш код) и даже отправить pullrequest. Если для вас это пока тёмный лес, то подключитесь в наше сообщество Telegram Hexlet, там в канале Волонтеры мы всегда поможем.</p>
                </div>
            </div>
            
            
            
            
            <div class="tab-content" id="content-6">
                <div class="halo">
                    <h3>PHP: Синтаксические ошибки</h3>
                    <p>Если программа на PHP написана синтаксически некорректно, то интерпретатор выводит на экран соответствующее сообщение, а также указание на файл и строчку в нём, где по его мнению произошла ошибка. Синтаксическая ошибка возникает в том случае, когда код был записан с нарушением грамматических правил. В человеческих языках грамматика важна, но текст с ошибками чаще всего можно понять и прочитать. В программировании всё строго. Любое мельчайшее нарушение — и программа даже не запустится. Примером может быть забытая ;, неправильно расставленные скобки и другие детали.</p>
                    <p>Вот пример кода с синтаксической ошибкой:</p>
                    <div class="container2">
                    <p>console.log('Hodor'</p>
                    <p>&lt;?php</p>
                    <p>print_r('Hodor')</p>
                    </div>
                    <p>Если запустить код выше, то мы увидим следующее сообщение: $ PHP Parse error: syntax error, unexpected end of file in /private/var/tmp/index.php on line 4. Подобные синтаксические ошибки в PHP относятся к разряду "Parse error". Как видно, в конце приводится путь до файла и номер строчки.</p>
                    <p>С одной стороны, ошибки "Parse error" — самые простые, потому что они связаны исключительно с грамматическими правилами написания кода, а не с самим смыслом кода. Их легко исправить: нужно лишь найти нарушение в записи.</p>
                    <p>С другой стороны, интерпретатор не всегда может чётко указать на это нарушение. Поэтому бывает, что забытую скобку нужно поставить не туда, куда указывает сообщение об ошибке.</p>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
</script>
<style>
.nuk{
    margin-left: 400px;
    height: 1550px;
    width: 1000px;
    border: 2px;
}
.tab {
    
    display: flex;
    flex-wrap: wrap;
}

.tab > input[type="radio"] {
    display: none;
}

.tab-content {
    
    display: none;
    width: 100%;
    margin-top: 1rem;
}

#tab-btn-11:checked~#content-1,
#tab-btn-22:checked~#content-2,
#tab-btn-33:checked~#content-3,
#tab-btn-44:checked~#content-4,
#tab-btn-55:checked~#content-5,
#tab-btn-66:checked~#content-6 {
    display: block;
}

.tab > label {
    display: block;
    padding: 0.5rem 1rem;
    cursor: pointer;
    transition: color .15s ease-in-out,background-color .15s ease-in-out,border-color .15s ease-in-out;
    text-decoration: none;
    color: #0d6efd;
    border: 0;
    border-radius: 0.375rem;
    background: 0 0;
}

.tab > input[type="radio"]:checked + label {
    cursor: default;
    color: #fff;
    background-color: #0d6efd;
}
.mag{
    margin: 50px;
    text-align: left
}
.halo{
    margin: 50px
}
.hal{
    text-align: left;
}

.container {
  width: 80%;
  margin: 0 auto;
  padding: 15px;
  background-color: #474747;
  border-top-left-radius: 10px;
  border-top-right-radius: 10px;

}
.container1 {
  width: 80%;
  margin: 0 auto;
  padding: 10px;
  background-color: #c9c9c9;
  text-align: left;
}
.container2{
    width: 80%;
    margin: 0 auto;
    padding: 10px;
    background-color: #eeeeee;
    text-align: left;
    border-top-left-radius: 10px;
    border-top-right-radius: 10px;
}
</style>