<template>
    <div class="pik">
        <h1>Основы Python</h1>
        <div class="mag">
            <h3>ВВЕДЕНИЕ</h3>
            <p>JavaScript — один из самых широко используемых языков. Он применяется в разработке игр, создании Web-приложений. Профессия «Frontend-разработчик» на Хекслете дает все необходимые знания и навыки для трудоустройства. Именно с этого курса начинается погружение в сам язык.</p>

            <p>В курсе даются основы программирования на JavaScript. Мы познакомимся с такими понятиями как представление данных в памяти, стандарты именования, кодирование строк и многими другими. Изучение основ программирования с самого нуля требует особого способа организации учебного материала. Необходимо первичное привыкание к языковым конструкциям, погружение в язык.</p>
        </div>
        <div class="tab">
            <input checked id="tab-btn-111" name="tab-btn" type="radio" value="">
            <label for="tab-btn-111">Привет, Мир!</label>
            <input id="tab-btn-222" name="tab-btn" type="radio" value="">
            <label for="tab-btn-222">Комментарии</label>
            <input id="tab-btn-333" name="tab-btn" type="radio" value="">
            <label for="tab-btn-333">Инструкции(Statements)</label>
            <input id="tab-btn-444" name="tab-btn" type="radio" value="">
            <label for="tab-btn-444">Как мы проверяем ваши решения</label>
            <input id="tab-btn-555" name="tab-btn" type="radio" value="">
            <label for="tab-btn-555">Ощибки оформления</label>



            <div class="tab-content" id="content-1">
                <div class="halo">
                    <h3>Python: Привет, Мир!</h3>
                    <p>Изучение нового языка программирования традиционно начинается с 'Hello, World!'. Это простая программа, которая выводит приветствие на экран и заодно знакомит с новым языком — его синтаксисом и структурой программы.</p>
                    <div class="container"></div>
                    <div class="container1">Hello, World!</div>
                    <p>Этой традиции уже больше сорока лет, поэтому и мы не будем нарушать ее. В первом уроке мы напишем программу Hello, World!. Чтобы сделать это, нужно дать компьютеру специальную команду. В языке Python это — print().</p>
                </div>
            </div>




            <div class="tab-content" id="content-2">
                <div class="halo">
                    <h3>Python: Комментарии</h3>
                    <p>Практически все языки программирования позволяют оставлять в коде комментарии. Они никак не используются интерпретатором. Они нужны исключительно для людей, чтобы программист оставлял пометки для себя и для других программистов.</p>
                    <p>С их помощью добавляют пояснения, как работает код, какие ошибки нужно поправить или не забыть что-то добавить позже:</p>
                    <div class="container2">
                        <p>// Удалить строку ниже после реализации задачи по регистрации</p>
                        <p>print(10)</p>
                    </div>
                    <p>Комментарии в Python начинаются со знака # и могут появляться в любом месте программы. Они могут занимать всю строку. Если одной строки мало, то создается несколько комментариев:</p>                    
                    <div class="container2">
                        <p># For Winterfell!</p>
                        <p># For Lanisters!</p>
                    </div>
                    <p>Комментарий может находиться на строке после кода:</p>
                    <div class="container2">
                        <p>print('I am the King') # For Lannisters!</p>
                    </div>
                </div>
            </div>




            <div class="tab-content" id="content-3">
                <div class="halo">
                    <h3>Python: Инструкции (Statements)</h3>
                    <p>Когда мы готовим блюдо, то четко следуем рецепту. Иначе еда окажется не такой, как ожидали. Это же правило действует и в программировании.</p>
                    <p>Чтобы увидеть на экране ожидаемый результат, нужно дать компьютеру четкие и пошаговые указания. Это можно сделать с помощью инструкций. Инструкция — это команда для компьютера, единица выполнения. Код на Python в этом случае — это набор инструкций. Его можно представить в виде пошагового рецепта.</p>
                    <p>Код на Python запускает <b>интерпретатор</b> — программу, которая выполняет инструкции строго по очереди. Как и шаги в рецепте, набор инструкций для интерпретатора пишутся по порядку и отделяются друг от друга переходом на следующую строку.</p>
                    <p>Разработчики должны понимать порядок действий в коде и уметь мысленно разделять программу на независимые части, удобные для анализа.</p>
                    <p>Посмотрим на пример кода с двумя инструкциями. При его запуске на экран последовательно выводятся два предложения:</p>
                    <div class="container2">
                        <p>print('Mother of Dragons.')</p>
                        <p>print('Dracarys!')</p>
                        <p># => Mother of Dragons.</p>
                        <p># => Dracarys!</p>
                    </div>
                    <p>Выше мы говорили, что инструкции отделяются друг от друга переходом на новую строку. Но есть и другой способ: их можно разделить точкой с запятой — ;:</p>
                    <div class="container2">
                        <p>print('Mother of Dragons.'); print('Drakarys!')</p>
                    </div>
                    <p>Технической разницы между первым и вторым вариантом нет — интерпретатор поймет инструкции одинаково. Разница только в том, что человеку будет неудобно читать второй вариант.</p>
                    <p>Лучше инструкции располагать друг под другом. Так коллегам будет удобнее читать ваш код, обслуживать его и вносить изменения.</p>
                </div>
            </div>




            <div class="tab-content" id="content-4">
                <div class="halo">
                    <h3>Python: Как мы проверяем ваши решения</h3>
                    <p>Наш сайт автоматически проверяет ваши решения. Как это работает?</p>
                    <p>В самом простом случае система просто запускает ваш код и смотрит на то, что вывелось на экран. А потом сверяет с тем, что мы «ожидали» по заданию.</p>
                    <p>В следующих, более сложных уроках вы будете писать функции — некие мини-программы, принимающие информацию из внешнего мира и производящие какие-то операции. Проверка ваших решений в таких случаях выглядит немного сложнее: система запускает ваше решение и передаёт какую-то информацию. Система также знает — «ожидает» — какой именно ответ должна дать правильная функция при таких входных данных.</p>
                    <p>Например, если ваша задача — написать функцию сложения двух чисел, то проверочная система будет передавать ей разные комбинации чисел и сверять ответ вашей функции с реальными суммами. Если во всех случаях ответы совпадут, то решение считается верным.</p>
                    <p>Такой подход называется тестированием, и он используется в реальной повседневной разработке. Обычно программист сначала пишет тест — проверочную программу, а потом уже ту программу, которую хотел написать. В процессе он постоянно запускает тесты и смотрит, приблизился ли он к решению.</p>
                    <p>Именно поэтому наш сайт говорит «Тесты пройдены», когда вы правильно решили задачу.</p>
                    <p>Вот простой пример: в одном из будущих уроков вам нужно будет написать функцию, которая производит вычисления и выдаёт ответ. Допустим, вы допустили небольшую ошибку, и функция выдала неправильное число. Система ответит примерно так:</p>
                    <div class="container"></div>
                    <div class="container1">
                        <p>AssertionError: '10' != '35'</p>
                    </div>
                    <p>Самое главное начинается после двоеточия: «значение "10" не равно ожидаемому значению "35"». То есть правильная функция должна была выдать 35, но текущее решение работает неправильно и выдаёт 10.</p>
                    <p>Ещё стоит отметить, что если вы видите, что в редакторе уже присутствует какой-то код, а вместе с ним комментарии BEGIN и END, то обычно это подразумевает, что вам нужно писать ваш код между этими самыми BEGIN и END! Код, данный вам заранее, трогать не стоит: это может повлиять на проверку правильности решения. Проще говоря: видите строчки с комментариями BEGIN и END — пишите свой код между ними!</p>
                    <hr>
                    <p>Иногда в процессе решения будет казаться, что вы сделали все правильно, но система "капризничает" и не принимает решение. Подобное поведение практически исключено. Нерабочие тесты просто не могут попасть на сайт, они автоматически запускаются после каждого изменения. В подавляющем большинстве таких случаев, (а все наши проекты в сумме провели миллионы проверок за много лет), ошибка содержится в коде решения. Она может быть очень незаметной, вместо английской буквы случайно ввели русскую, вместо верхнего регистра использовали нижний или забыли вывести запятую. Другие случаи сложнее. Возможно ваше решение работает для одного набора входных данных, но не работает для другого. Поэтому всегда внимательно читайте условие задачи и вывод тестов. Там почти наверняка есть указание на ошибку.</p>
                    <p>Однако, если вы уверены в ошибке или нашли какую-то неточность, то вы всегда можете указать на нее. В конце каждой теории есть ссылка на содержимое урока на гитхабе (этот проект полностью открытый!). Перейдя туда, вы можете написать issue, посмотреть содержимое тестов (там видно, как вызывается ваш код) и даже отправить pullrequest.</p>
                </div>
            </div>
            
            
            
            
            <div class="tab-content" id="content-5">
                <div class="halo">
                        <h3>Python: Синтаксические ошибки</h3>
                        <p>Если программа на Python написана синтаксически некорректно, то интерпретатор выводит на экран соответствующее сообщение. Также он указывает на файл и строчку, где произошла ошибка.</p>
                        <p><b>Синтаксическая ошибка</b> возникает в том случае, когда код записали с нарушением грамматических правил. В естественных языках грамматика важна, но текст с ошибками обычно можно понять и прочитать. В программировании все строго. Мельчайшее нарушение — и программа даже не запустится. Примером может быть забытая ;, неправильно расставленные скобки и другие детали.</p>
                        <p>Вот пример кода с синтаксической ошибкой:</p>
                        <div class="container2">
                        <p>print('Hodor)</p>
                        </div>
                        <p>Если запустить код выше, то мы увидим следующее сообщение:</p>
                        <div class="container2">
                        <p>$ python index.py</p>
                        <p>File "index.py", line 1</p>
                        <p>print('Hodor)</p>
                        <p>            ^</p>
                        <p>SyntaxError: EOL while scanning string literal</p>
                        </div>
                        <p>С одной стороны, ошибки синтаксиса — самые простые, потому что они связаны с грамматическими правилами написания кода, а не со смыслом кода. Их легко исправить: нужно лишь найти нарушение в записи. С другой стороны, интерпретатор не всегда может четко указать на это нарушение. Поэтому бывает, что забытую скобку нужно поставить не туда, куда указывает сообщение об ошибке.</p>
                       
                </div>
            </div>
        </div>
    </div>
</template>

<script>

</script>

<style>
.pik{
    margin-left: 400px;
    height: 1550px;
    width: 1000px;
    border: 2px;
}
.tab {
    
    display: flex;
    flex-wrap: wrap;
}

.tab > input[type="radio"] {
    display: none;
}
.tab-content {
    
    display: none;
    width: 100%;
    margin-top: 1rem;
}
#tab-btn-111:checked~#content-1,
#tab-btn-222:checked~#content-2,
#tab-btn-333:checked~#content-3,
#tab-btn-444:checked~#content-4,
#tab-btn-555:checked~#content-5 {
    display: block;
}
.tab > label {
    display: block;
    padding: 0.5rem 1rem;
    cursor: pointer;
    transition: color .15s ease-in-out,background-color .15s ease-in-out,border-color .15s ease-in-out;
    text-decoration: none;
    color: #0d6efd;
    border: 0;
    border-radius: 0.375rem;
    background: 0 0;
}

.tab > input[type="radio"]:checked + label {
    cursor: default;
    color: #fff;
    background-color: #0d6efd;
}
.halo{
    margin: 50px
}
.hal{
    text-align: left;
}
.mag{
    margin: 50px;
    text-align: left
}
.container {
  width: 80%;
  margin: 0 auto;
  padding: 15px;
  background-color: #474747;
  border-top-left-radius: 10px;
  border-top-right-radius: 10px;

}
.container1 {
  width: 80%;
  margin: 0 auto;
  padding: 10px;
  background-color: #c9c9c9;
  text-align: left;
}
.container2{
    width: 80%;
    margin: 0 auto;
    padding: 10px;
    background-color: #eeeeee;
    text-align: left;
    border-top-left-radius: 10px;
    border-top-right-radius: 10px;
}
</style>